// Generated by jextract

package freeglut.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _NT_TIB32 {
 *     DWORD ExceptionList;
 *     DWORD StackBase;
 *     DWORD StackLimit;
 *     DWORD SubSystemTib;
 *     union {
 *         DWORD FiberData;
 *         DWORD Version;
 *     };
 *     DWORD ArbitraryUserPointer;
 *     DWORD Self;
 * }
 * }
 */
public class _NT_TIB32 {

    _NT_TIB32() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        freeglut_h.C_LONG.withName("ExceptionList"),
        freeglut_h.C_LONG.withName("StackBase"),
        freeglut_h.C_LONG.withName("StackLimit"),
        freeglut_h.C_LONG.withName("SubSystemTib"),
        MemoryLayout.unionLayout(
            freeglut_h.C_LONG.withName("FiberData"),
            freeglut_h.C_LONG.withName("Version")
        ).withName("$anon$11512:5"),
        freeglut_h.C_LONG.withName("ArbitraryUserPointer"),
        freeglut_h.C_LONG.withName("Self")
    ).withName("_NT_TIB32");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt ExceptionList$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ExceptionList"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD ExceptionList
     * }
     */
    public static final OfInt ExceptionList$layout() {
        return ExceptionList$LAYOUT;
    }

    private static final long ExceptionList$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD ExceptionList
     * }
     */
    public static final long ExceptionList$offset() {
        return ExceptionList$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD ExceptionList
     * }
     */
    public static int ExceptionList(MemorySegment struct) {
        return struct.get(ExceptionList$LAYOUT, ExceptionList$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD ExceptionList
     * }
     */
    public static void ExceptionList(MemorySegment struct, int fieldValue) {
        struct.set(ExceptionList$LAYOUT, ExceptionList$OFFSET, fieldValue);
    }

    private static final OfInt StackBase$LAYOUT = (OfInt)$LAYOUT.select(groupElement("StackBase"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD StackBase
     * }
     */
    public static final OfInt StackBase$layout() {
        return StackBase$LAYOUT;
    }

    private static final long StackBase$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD StackBase
     * }
     */
    public static final long StackBase$offset() {
        return StackBase$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD StackBase
     * }
     */
    public static int StackBase(MemorySegment struct) {
        return struct.get(StackBase$LAYOUT, StackBase$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD StackBase
     * }
     */
    public static void StackBase(MemorySegment struct, int fieldValue) {
        struct.set(StackBase$LAYOUT, StackBase$OFFSET, fieldValue);
    }

    private static final OfInt StackLimit$LAYOUT = (OfInt)$LAYOUT.select(groupElement("StackLimit"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD StackLimit
     * }
     */
    public static final OfInt StackLimit$layout() {
        return StackLimit$LAYOUT;
    }

    private static final long StackLimit$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD StackLimit
     * }
     */
    public static final long StackLimit$offset() {
        return StackLimit$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD StackLimit
     * }
     */
    public static int StackLimit(MemorySegment struct) {
        return struct.get(StackLimit$LAYOUT, StackLimit$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD StackLimit
     * }
     */
    public static void StackLimit(MemorySegment struct, int fieldValue) {
        struct.set(StackLimit$LAYOUT, StackLimit$OFFSET, fieldValue);
    }

    private static final OfInt SubSystemTib$LAYOUT = (OfInt)$LAYOUT.select(groupElement("SubSystemTib"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD SubSystemTib
     * }
     */
    public static final OfInt SubSystemTib$layout() {
        return SubSystemTib$LAYOUT;
    }

    private static final long SubSystemTib$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD SubSystemTib
     * }
     */
    public static final long SubSystemTib$offset() {
        return SubSystemTib$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD SubSystemTib
     * }
     */
    public static int SubSystemTib(MemorySegment struct) {
        return struct.get(SubSystemTib$LAYOUT, SubSystemTib$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD SubSystemTib
     * }
     */
    public static void SubSystemTib(MemorySegment struct, int fieldValue) {
        struct.set(SubSystemTib$LAYOUT, SubSystemTib$OFFSET, fieldValue);
    }

    private static final OfInt FiberData$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$11512:5"), groupElement("FiberData"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD FiberData
     * }
     */
    public static final OfInt FiberData$layout() {
        return FiberData$LAYOUT;
    }

    private static final long FiberData$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD FiberData
     * }
     */
    public static final long FiberData$offset() {
        return FiberData$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD FiberData
     * }
     */
    public static int FiberData(MemorySegment struct) {
        return struct.get(FiberData$LAYOUT, FiberData$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD FiberData
     * }
     */
    public static void FiberData(MemorySegment struct, int fieldValue) {
        struct.set(FiberData$LAYOUT, FiberData$OFFSET, fieldValue);
    }

    private static final OfInt Version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$11512:5"), groupElement("Version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static final OfInt Version$layout() {
        return Version$LAYOUT;
    }

    private static final long Version$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static final long Version$offset() {
        return Version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static int Version(MemorySegment struct) {
        return struct.get(Version$LAYOUT, Version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static void Version(MemorySegment struct, int fieldValue) {
        struct.set(Version$LAYOUT, Version$OFFSET, fieldValue);
    }

    private static final OfInt ArbitraryUserPointer$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ArbitraryUserPointer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD ArbitraryUserPointer
     * }
     */
    public static final OfInt ArbitraryUserPointer$layout() {
        return ArbitraryUserPointer$LAYOUT;
    }

    private static final long ArbitraryUserPointer$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD ArbitraryUserPointer
     * }
     */
    public static final long ArbitraryUserPointer$offset() {
        return ArbitraryUserPointer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD ArbitraryUserPointer
     * }
     */
    public static int ArbitraryUserPointer(MemorySegment struct) {
        return struct.get(ArbitraryUserPointer$LAYOUT, ArbitraryUserPointer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD ArbitraryUserPointer
     * }
     */
    public static void ArbitraryUserPointer(MemorySegment struct, int fieldValue) {
        struct.set(ArbitraryUserPointer$LAYOUT, ArbitraryUserPointer$OFFSET, fieldValue);
    }

    private static final OfInt Self$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Self"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Self
     * }
     */
    public static final OfInt Self$layout() {
        return Self$LAYOUT;
    }

    private static final long Self$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Self
     * }
     */
    public static final long Self$offset() {
        return Self$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Self
     * }
     */
    public static int Self(MemorySegment struct) {
        return struct.get(Self$LAYOUT, Self$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Self
     * }
     */
    public static void Self(MemorySegment struct, int fieldValue) {
        struct.set(Self$LAYOUT, Self$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

