// Generated by jextract

package freeglut.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     DWORD State;
 *     DWORD Latency;
 *     DWORD Speed;
 *     DWORD64 Processors;
 * }
 * }
 */
public class PPM_PERFSTATE_DOMAIN_EVENT {

    PPM_PERFSTATE_DOMAIN_EVENT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        freeglut_h.C_LONG.withName("State"),
        freeglut_h.C_LONG.withName("Latency"),
        freeglut_h.C_LONG.withName("Speed"),
        MemoryLayout.paddingLayout(4),
        freeglut_h.C_LONG_LONG.withName("Processors")
    ).withName("$anon$16480:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt State$LAYOUT = (OfInt)$LAYOUT.select(groupElement("State"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD State
     * }
     */
    public static final OfInt State$layout() {
        return State$LAYOUT;
    }

    private static final long State$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD State
     * }
     */
    public static final long State$offset() {
        return State$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD State
     * }
     */
    public static int State(MemorySegment struct) {
        return struct.get(State$LAYOUT, State$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD State
     * }
     */
    public static void State(MemorySegment struct, int fieldValue) {
        struct.set(State$LAYOUT, State$OFFSET, fieldValue);
    }

    private static final OfInt Latency$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Latency"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Latency
     * }
     */
    public static final OfInt Latency$layout() {
        return Latency$LAYOUT;
    }

    private static final long Latency$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Latency
     * }
     */
    public static final long Latency$offset() {
        return Latency$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Latency
     * }
     */
    public static int Latency(MemorySegment struct) {
        return struct.get(Latency$LAYOUT, Latency$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Latency
     * }
     */
    public static void Latency(MemorySegment struct, int fieldValue) {
        struct.set(Latency$LAYOUT, Latency$OFFSET, fieldValue);
    }

    private static final OfInt Speed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Speed"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Speed
     * }
     */
    public static final OfInt Speed$layout() {
        return Speed$LAYOUT;
    }

    private static final long Speed$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Speed
     * }
     */
    public static final long Speed$offset() {
        return Speed$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Speed
     * }
     */
    public static int Speed(MemorySegment struct) {
        return struct.get(Speed$LAYOUT, Speed$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Speed
     * }
     */
    public static void Speed(MemorySegment struct, int fieldValue) {
        struct.set(Speed$LAYOUT, Speed$OFFSET, fieldValue);
    }

    private static final OfLong Processors$LAYOUT = (OfLong)$LAYOUT.select(groupElement("Processors"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD64 Processors
     * }
     */
    public static final OfLong Processors$layout() {
        return Processors$LAYOUT;
    }

    private static final long Processors$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD64 Processors
     * }
     */
    public static final long Processors$offset() {
        return Processors$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD64 Processors
     * }
     */
    public static long Processors(MemorySegment struct) {
        return struct.get(Processors$LAYOUT, Processors$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD64 Processors
     * }
     */
    public static void Processors(MemorySegment struct, long fieldValue) {
        struct.set(Processors$LAYOUT, Processors$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

