// Generated by jextract

package freeglut.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct tagFILTERKEYS {
 *     UINT cbSize;
 *     DWORD dwFlags;
 *     DWORD iWaitMSec;
 *     DWORD iDelayMSec;
 *     DWORD iRepeatMSec;
 *     DWORD iBounceMSec;
 * }
 * }
 */
public class tagFILTERKEYS {

    tagFILTERKEYS() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        freeglut_h.C_INT.withName("cbSize"),
        freeglut_h.C_LONG.withName("dwFlags"),
        freeglut_h.C_LONG.withName("iWaitMSec"),
        freeglut_h.C_LONG.withName("iDelayMSec"),
        freeglut_h.C_LONG.withName("iRepeatMSec"),
        freeglut_h.C_LONG.withName("iBounceMSec")
    ).withName("tagFILTERKEYS");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt cbSize$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cbSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * UINT cbSize
     * }
     */
    public static final OfInt cbSize$layout() {
        return cbSize$LAYOUT;
    }

    private static final long cbSize$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * UINT cbSize
     * }
     */
    public static final long cbSize$offset() {
        return cbSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * UINT cbSize
     * }
     */
    public static int cbSize(MemorySegment struct) {
        return struct.get(cbSize$LAYOUT, cbSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * UINT cbSize
     * }
     */
    public static void cbSize(MemorySegment struct, int fieldValue) {
        struct.set(cbSize$LAYOUT, cbSize$OFFSET, fieldValue);
    }

    private static final OfInt dwFlags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwFlags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwFlags
     * }
     */
    public static final OfInt dwFlags$layout() {
        return dwFlags$LAYOUT;
    }

    private static final long dwFlags$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwFlags
     * }
     */
    public static final long dwFlags$offset() {
        return dwFlags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwFlags
     * }
     */
    public static int dwFlags(MemorySegment struct) {
        return struct.get(dwFlags$LAYOUT, dwFlags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwFlags
     * }
     */
    public static void dwFlags(MemorySegment struct, int fieldValue) {
        struct.set(dwFlags$LAYOUT, dwFlags$OFFSET, fieldValue);
    }

    private static final OfInt iWaitMSec$LAYOUT = (OfInt)$LAYOUT.select(groupElement("iWaitMSec"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD iWaitMSec
     * }
     */
    public static final OfInt iWaitMSec$layout() {
        return iWaitMSec$LAYOUT;
    }

    private static final long iWaitMSec$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD iWaitMSec
     * }
     */
    public static final long iWaitMSec$offset() {
        return iWaitMSec$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD iWaitMSec
     * }
     */
    public static int iWaitMSec(MemorySegment struct) {
        return struct.get(iWaitMSec$LAYOUT, iWaitMSec$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD iWaitMSec
     * }
     */
    public static void iWaitMSec(MemorySegment struct, int fieldValue) {
        struct.set(iWaitMSec$LAYOUT, iWaitMSec$OFFSET, fieldValue);
    }

    private static final OfInt iDelayMSec$LAYOUT = (OfInt)$LAYOUT.select(groupElement("iDelayMSec"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD iDelayMSec
     * }
     */
    public static final OfInt iDelayMSec$layout() {
        return iDelayMSec$LAYOUT;
    }

    private static final long iDelayMSec$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD iDelayMSec
     * }
     */
    public static final long iDelayMSec$offset() {
        return iDelayMSec$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD iDelayMSec
     * }
     */
    public static int iDelayMSec(MemorySegment struct) {
        return struct.get(iDelayMSec$LAYOUT, iDelayMSec$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD iDelayMSec
     * }
     */
    public static void iDelayMSec(MemorySegment struct, int fieldValue) {
        struct.set(iDelayMSec$LAYOUT, iDelayMSec$OFFSET, fieldValue);
    }

    private static final OfInt iRepeatMSec$LAYOUT = (OfInt)$LAYOUT.select(groupElement("iRepeatMSec"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD iRepeatMSec
     * }
     */
    public static final OfInt iRepeatMSec$layout() {
        return iRepeatMSec$LAYOUT;
    }

    private static final long iRepeatMSec$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD iRepeatMSec
     * }
     */
    public static final long iRepeatMSec$offset() {
        return iRepeatMSec$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD iRepeatMSec
     * }
     */
    public static int iRepeatMSec(MemorySegment struct) {
        return struct.get(iRepeatMSec$LAYOUT, iRepeatMSec$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD iRepeatMSec
     * }
     */
    public static void iRepeatMSec(MemorySegment struct, int fieldValue) {
        struct.set(iRepeatMSec$LAYOUT, iRepeatMSec$OFFSET, fieldValue);
    }

    private static final OfInt iBounceMSec$LAYOUT = (OfInt)$LAYOUT.select(groupElement("iBounceMSec"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD iBounceMSec
     * }
     */
    public static final OfInt iBounceMSec$layout() {
        return iBounceMSec$LAYOUT;
    }

    private static final long iBounceMSec$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD iBounceMSec
     * }
     */
    public static final long iBounceMSec$offset() {
        return iBounceMSec$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD iBounceMSec
     * }
     */
    public static int iBounceMSec(MemorySegment struct) {
        return struct.get(iBounceMSec$LAYOUT, iBounceMSec$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD iBounceMSec
     * }
     */
    public static void iBounceMSec(MemorySegment struct, int fieldValue) {
        struct.set(iBounceMSec$LAYOUT, iBounceMSec$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

