// Generated by jextract

package freeglut.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct tagINPUT_TRANSFORM {
 *     union {
 *         struct {
 *             float _11;
 *             float _12;
 *             float _13;
 *             float _14;
 *             float _21;
 *             float _22;
 *             float _23;
 *             float _24;
 *             float _31;
 *             float _32;
 *             float _33;
 *             float _34;
 *             float _41;
 *             float _42;
 *             float _43;
 *             float _44;
 *         };
 *         float m[4][4];
 *     };
 * }
 * }
 */
public class tagINPUT_TRANSFORM {

    tagINPUT_TRANSFORM() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.unionLayout(
            MemoryLayout.structLayout(
                freeglut_h.C_FLOAT.withName("_11"),
                freeglut_h.C_FLOAT.withName("_12"),
                freeglut_h.C_FLOAT.withName("_13"),
                freeglut_h.C_FLOAT.withName("_14"),
                freeglut_h.C_FLOAT.withName("_21"),
                freeglut_h.C_FLOAT.withName("_22"),
                freeglut_h.C_FLOAT.withName("_23"),
                freeglut_h.C_FLOAT.withName("_24"),
                freeglut_h.C_FLOAT.withName("_31"),
                freeglut_h.C_FLOAT.withName("_32"),
                freeglut_h.C_FLOAT.withName("_33"),
                freeglut_h.C_FLOAT.withName("_34"),
                freeglut_h.C_FLOAT.withName("_41"),
                freeglut_h.C_FLOAT.withName("_42"),
                freeglut_h.C_FLOAT.withName("_43"),
                freeglut_h.C_FLOAT.withName("_44")
            ).withName("$anon$6796:9"),
            MemoryLayout.sequenceLayout(4, MemoryLayout.sequenceLayout(4, freeglut_h.C_FLOAT)).withName("m")
        ).withName("$anon$6795:5")
    ).withName("tagINPUT_TRANSFORM");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfFloat _11$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("$anon$6796:9"), groupElement("_11"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float _11
     * }
     */
    public static final OfFloat _11$layout() {
        return _11$LAYOUT;
    }

    private static final long _11$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float _11
     * }
     */
    public static final long _11$offset() {
        return _11$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float _11
     * }
     */
    public static float _11(MemorySegment struct) {
        return struct.get(_11$LAYOUT, _11$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float _11
     * }
     */
    public static void _11(MemorySegment struct, float fieldValue) {
        struct.set(_11$LAYOUT, _11$OFFSET, fieldValue);
    }

    private static final OfFloat _12$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("$anon$6796:9"), groupElement("_12"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float _12
     * }
     */
    public static final OfFloat _12$layout() {
        return _12$LAYOUT;
    }

    private static final long _12$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float _12
     * }
     */
    public static final long _12$offset() {
        return _12$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float _12
     * }
     */
    public static float _12(MemorySegment struct) {
        return struct.get(_12$LAYOUT, _12$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float _12
     * }
     */
    public static void _12(MemorySegment struct, float fieldValue) {
        struct.set(_12$LAYOUT, _12$OFFSET, fieldValue);
    }

    private static final OfFloat _13$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("$anon$6796:9"), groupElement("_13"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float _13
     * }
     */
    public static final OfFloat _13$layout() {
        return _13$LAYOUT;
    }

    private static final long _13$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float _13
     * }
     */
    public static final long _13$offset() {
        return _13$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float _13
     * }
     */
    public static float _13(MemorySegment struct) {
        return struct.get(_13$LAYOUT, _13$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float _13
     * }
     */
    public static void _13(MemorySegment struct, float fieldValue) {
        struct.set(_13$LAYOUT, _13$OFFSET, fieldValue);
    }

    private static final OfFloat _14$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("$anon$6796:9"), groupElement("_14"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float _14
     * }
     */
    public static final OfFloat _14$layout() {
        return _14$LAYOUT;
    }

    private static final long _14$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float _14
     * }
     */
    public static final long _14$offset() {
        return _14$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float _14
     * }
     */
    public static float _14(MemorySegment struct) {
        return struct.get(_14$LAYOUT, _14$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float _14
     * }
     */
    public static void _14(MemorySegment struct, float fieldValue) {
        struct.set(_14$LAYOUT, _14$OFFSET, fieldValue);
    }

    private static final OfFloat _21$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("$anon$6796:9"), groupElement("_21"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float _21
     * }
     */
    public static final OfFloat _21$layout() {
        return _21$LAYOUT;
    }

    private static final long _21$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float _21
     * }
     */
    public static final long _21$offset() {
        return _21$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float _21
     * }
     */
    public static float _21(MemorySegment struct) {
        return struct.get(_21$LAYOUT, _21$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float _21
     * }
     */
    public static void _21(MemorySegment struct, float fieldValue) {
        struct.set(_21$LAYOUT, _21$OFFSET, fieldValue);
    }

    private static final OfFloat _22$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("$anon$6796:9"), groupElement("_22"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float _22
     * }
     */
    public static final OfFloat _22$layout() {
        return _22$LAYOUT;
    }

    private static final long _22$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float _22
     * }
     */
    public static final long _22$offset() {
        return _22$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float _22
     * }
     */
    public static float _22(MemorySegment struct) {
        return struct.get(_22$LAYOUT, _22$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float _22
     * }
     */
    public static void _22(MemorySegment struct, float fieldValue) {
        struct.set(_22$LAYOUT, _22$OFFSET, fieldValue);
    }

    private static final OfFloat _23$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("$anon$6796:9"), groupElement("_23"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float _23
     * }
     */
    public static final OfFloat _23$layout() {
        return _23$LAYOUT;
    }

    private static final long _23$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float _23
     * }
     */
    public static final long _23$offset() {
        return _23$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float _23
     * }
     */
    public static float _23(MemorySegment struct) {
        return struct.get(_23$LAYOUT, _23$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float _23
     * }
     */
    public static void _23(MemorySegment struct, float fieldValue) {
        struct.set(_23$LAYOUT, _23$OFFSET, fieldValue);
    }

    private static final OfFloat _24$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("$anon$6796:9"), groupElement("_24"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float _24
     * }
     */
    public static final OfFloat _24$layout() {
        return _24$LAYOUT;
    }

    private static final long _24$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float _24
     * }
     */
    public static final long _24$offset() {
        return _24$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float _24
     * }
     */
    public static float _24(MemorySegment struct) {
        return struct.get(_24$LAYOUT, _24$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float _24
     * }
     */
    public static void _24(MemorySegment struct, float fieldValue) {
        struct.set(_24$LAYOUT, _24$OFFSET, fieldValue);
    }

    private static final OfFloat _31$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("$anon$6796:9"), groupElement("_31"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float _31
     * }
     */
    public static final OfFloat _31$layout() {
        return _31$LAYOUT;
    }

    private static final long _31$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float _31
     * }
     */
    public static final long _31$offset() {
        return _31$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float _31
     * }
     */
    public static float _31(MemorySegment struct) {
        return struct.get(_31$LAYOUT, _31$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float _31
     * }
     */
    public static void _31(MemorySegment struct, float fieldValue) {
        struct.set(_31$LAYOUT, _31$OFFSET, fieldValue);
    }

    private static final OfFloat _32$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("$anon$6796:9"), groupElement("_32"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float _32
     * }
     */
    public static final OfFloat _32$layout() {
        return _32$LAYOUT;
    }

    private static final long _32$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float _32
     * }
     */
    public static final long _32$offset() {
        return _32$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float _32
     * }
     */
    public static float _32(MemorySegment struct) {
        return struct.get(_32$LAYOUT, _32$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float _32
     * }
     */
    public static void _32(MemorySegment struct, float fieldValue) {
        struct.set(_32$LAYOUT, _32$OFFSET, fieldValue);
    }

    private static final OfFloat _33$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("$anon$6796:9"), groupElement("_33"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float _33
     * }
     */
    public static final OfFloat _33$layout() {
        return _33$LAYOUT;
    }

    private static final long _33$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float _33
     * }
     */
    public static final long _33$offset() {
        return _33$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float _33
     * }
     */
    public static float _33(MemorySegment struct) {
        return struct.get(_33$LAYOUT, _33$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float _33
     * }
     */
    public static void _33(MemorySegment struct, float fieldValue) {
        struct.set(_33$LAYOUT, _33$OFFSET, fieldValue);
    }

    private static final OfFloat _34$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("$anon$6796:9"), groupElement("_34"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float _34
     * }
     */
    public static final OfFloat _34$layout() {
        return _34$LAYOUT;
    }

    private static final long _34$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float _34
     * }
     */
    public static final long _34$offset() {
        return _34$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float _34
     * }
     */
    public static float _34(MemorySegment struct) {
        return struct.get(_34$LAYOUT, _34$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float _34
     * }
     */
    public static void _34(MemorySegment struct, float fieldValue) {
        struct.set(_34$LAYOUT, _34$OFFSET, fieldValue);
    }

    private static final OfFloat _41$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("$anon$6796:9"), groupElement("_41"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float _41
     * }
     */
    public static final OfFloat _41$layout() {
        return _41$LAYOUT;
    }

    private static final long _41$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float _41
     * }
     */
    public static final long _41$offset() {
        return _41$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float _41
     * }
     */
    public static float _41(MemorySegment struct) {
        return struct.get(_41$LAYOUT, _41$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float _41
     * }
     */
    public static void _41(MemorySegment struct, float fieldValue) {
        struct.set(_41$LAYOUT, _41$OFFSET, fieldValue);
    }

    private static final OfFloat _42$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("$anon$6796:9"), groupElement("_42"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float _42
     * }
     */
    public static final OfFloat _42$layout() {
        return _42$LAYOUT;
    }

    private static final long _42$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float _42
     * }
     */
    public static final long _42$offset() {
        return _42$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float _42
     * }
     */
    public static float _42(MemorySegment struct) {
        return struct.get(_42$LAYOUT, _42$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float _42
     * }
     */
    public static void _42(MemorySegment struct, float fieldValue) {
        struct.set(_42$LAYOUT, _42$OFFSET, fieldValue);
    }

    private static final OfFloat _43$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("$anon$6796:9"), groupElement("_43"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float _43
     * }
     */
    public static final OfFloat _43$layout() {
        return _43$LAYOUT;
    }

    private static final long _43$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float _43
     * }
     */
    public static final long _43$offset() {
        return _43$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float _43
     * }
     */
    public static float _43(MemorySegment struct) {
        return struct.get(_43$LAYOUT, _43$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float _43
     * }
     */
    public static void _43(MemorySegment struct, float fieldValue) {
        struct.set(_43$LAYOUT, _43$OFFSET, fieldValue);
    }

    private static final OfFloat _44$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("$anon$6796:9"), groupElement("_44"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float _44
     * }
     */
    public static final OfFloat _44$layout() {
        return _44$LAYOUT;
    }

    private static final long _44$OFFSET = 60;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float _44
     * }
     */
    public static final long _44$offset() {
        return _44$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float _44
     * }
     */
    public static float _44(MemorySegment struct) {
        return struct.get(_44$LAYOUT, _44$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float _44
     * }
     */
    public static void _44(MemorySegment struct, float fieldValue) {
        struct.set(_44$LAYOUT, _44$OFFSET, fieldValue);
    }

    private static final SequenceLayout m$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("$anon$6795:5"), groupElement("m"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float m[4][4]
     * }
     */
    public static final SequenceLayout m$layout() {
        return m$LAYOUT;
    }

    private static final long m$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float m[4][4]
     * }
     */
    public static final long m$offset() {
        return m$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float m[4][4]
     * }
     */
    public static MemorySegment m(MemorySegment struct) {
        return struct.asSlice(m$OFFSET, m$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float m[4][4]
     * }
     */
    public static void m(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, m$OFFSET, m$LAYOUT.byteSize());
    }

    private static long[] m$DIMS = { 4, 4 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * float m[4][4]
     * }
     */
    public static long[] m$dimensions() {
        return m$DIMS;
    }
    private static final VarHandle m$ELEM_HANDLE = m$LAYOUT.varHandle(sequenceElement(), sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * float m[4][4]
     * }
     */
    public static float m(MemorySegment struct, long index0, long index1) {
        return (float)m$ELEM_HANDLE.get(struct, 0L, index0, index1);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * float m[4][4]
     * }
     */
    public static void m(MemorySegment struct, long index0, long index1, float fieldValue) {
        m$ELEM_HANDLE.set(struct, 0L, index0, index1, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

