// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
public class _CERT_ID {

    static final  GroupLayout $struct$LAYOUT = MemoryLayout.structLayout(
        Constants$root.C_LONG$LAYOUT.withName("dwIdChoice"),
        MemoryLayout.paddingLayout(32),
        MemoryLayout.unionLayout(
            MemoryLayout.structLayout(
                MemoryLayout.structLayout(
                    Constants$root.C_LONG$LAYOUT.withName("cbData"),
                    MemoryLayout.paddingLayout(32),
                    Constants$root.C_POINTER$LAYOUT.withName("pbData")
                ).withName("Issuer"),
                MemoryLayout.structLayout(
                    Constants$root.C_LONG$LAYOUT.withName("cbData"),
                    MemoryLayout.paddingLayout(32),
                    Constants$root.C_POINTER$LAYOUT.withName("pbData")
                ).withName("SerialNumber")
            ).withName("IssuerSerialNumber"),
            MemoryLayout.structLayout(
                Constants$root.C_LONG$LAYOUT.withName("cbData"),
                MemoryLayout.paddingLayout(32),
                Constants$root.C_POINTER$LAYOUT.withName("pbData")
            ).withName("KeyId"),
            MemoryLayout.structLayout(
                Constants$root.C_LONG$LAYOUT.withName("cbData"),
                MemoryLayout.paddingLayout(32),
                Constants$root.C_POINTER$LAYOUT.withName("pbData")
            ).withName("HashId")
        ).withName("$anon$0")
    ).withName("_CERT_ID");
    public static MemoryLayout $LAYOUT() {
        return _CERT_ID.$struct$LAYOUT;
    }
    static final VarHandle dwIdChoice$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("dwIdChoice"));
    public static VarHandle dwIdChoice$VH() {
        return _CERT_ID.dwIdChoice$VH;
    }
    public static int dwIdChoice$get(MemorySegment seg) {
        return (int)_CERT_ID.dwIdChoice$VH.get(seg);
    }
    public static void dwIdChoice$set( MemorySegment seg, int x) {
        _CERT_ID.dwIdChoice$VH.set(seg, x);
    }
    public static int dwIdChoice$get(MemorySegment seg, long index) {
        return (int)_CERT_ID.dwIdChoice$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void dwIdChoice$set(MemorySegment seg, long index, int x) {
        _CERT_ID.dwIdChoice$VH.set(seg.asSlice(index*sizeof()), x);
    }
    public static MemorySegment IssuerSerialNumber$slice(MemorySegment seg) {
        return seg.asSlice(8, 32);
    }
    public static MemorySegment KeyId$slice(MemorySegment seg) {
        return seg.asSlice(8, 16);
    }
    public static MemorySegment HashId$slice(MemorySegment seg) {
        return seg.asSlice(8, 16);
    }
    public static long sizeof() { return $LAYOUT().byteSize(); }
    public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
    public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
    }
    public static MemorySegment ofAddress(MemoryAddress addr, MemorySession session) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, session); }
}


