// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _CERT_LOGOTYPE_DATA {
 *     DWORD cLogotypeImage;
 *     PCERT_LOGOTYPE_IMAGE rgLogotypeImage;
 *     DWORD cLogotypeAudio;
 *     PCERT_LOGOTYPE_AUDIO rgLogotypeAudio;
 * }
 * }
 */
public class _CERT_LOGOTYPE_DATA {

    _CERT_LOGOTYPE_DATA() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("cLogotypeImage"),
        MemoryLayout.paddingLayout(4),
        wgl_h.C_POINTER.withName("rgLogotypeImage"),
        wgl_h.C_LONG.withName("cLogotypeAudio"),
        MemoryLayout.paddingLayout(4),
        wgl_h.C_POINTER.withName("rgLogotypeAudio")
    ).withName("_CERT_LOGOTYPE_DATA");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt cLogotypeImage$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cLogotypeImage"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD cLogotypeImage
     * }
     */
    public static final OfInt cLogotypeImage$layout() {
        return cLogotypeImage$LAYOUT;
    }

    private static final long cLogotypeImage$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD cLogotypeImage
     * }
     */
    public static final long cLogotypeImage$offset() {
        return cLogotypeImage$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD cLogotypeImage
     * }
     */
    public static int cLogotypeImage(MemorySegment struct) {
        return struct.get(cLogotypeImage$LAYOUT, cLogotypeImage$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD cLogotypeImage
     * }
     */
    public static void cLogotypeImage(MemorySegment struct, int fieldValue) {
        struct.set(cLogotypeImage$LAYOUT, cLogotypeImage$OFFSET, fieldValue);
    }

    private static final AddressLayout rgLogotypeImage$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("rgLogotypeImage"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PCERT_LOGOTYPE_IMAGE rgLogotypeImage
     * }
     */
    public static final AddressLayout rgLogotypeImage$layout() {
        return rgLogotypeImage$LAYOUT;
    }

    private static final long rgLogotypeImage$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PCERT_LOGOTYPE_IMAGE rgLogotypeImage
     * }
     */
    public static final long rgLogotypeImage$offset() {
        return rgLogotypeImage$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PCERT_LOGOTYPE_IMAGE rgLogotypeImage
     * }
     */
    public static MemorySegment rgLogotypeImage(MemorySegment struct) {
        return struct.get(rgLogotypeImage$LAYOUT, rgLogotypeImage$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PCERT_LOGOTYPE_IMAGE rgLogotypeImage
     * }
     */
    public static void rgLogotypeImage(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(rgLogotypeImage$LAYOUT, rgLogotypeImage$OFFSET, fieldValue);
    }

    private static final OfInt cLogotypeAudio$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cLogotypeAudio"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD cLogotypeAudio
     * }
     */
    public static final OfInt cLogotypeAudio$layout() {
        return cLogotypeAudio$LAYOUT;
    }

    private static final long cLogotypeAudio$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD cLogotypeAudio
     * }
     */
    public static final long cLogotypeAudio$offset() {
        return cLogotypeAudio$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD cLogotypeAudio
     * }
     */
    public static int cLogotypeAudio(MemorySegment struct) {
        return struct.get(cLogotypeAudio$LAYOUT, cLogotypeAudio$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD cLogotypeAudio
     * }
     */
    public static void cLogotypeAudio(MemorySegment struct, int fieldValue) {
        struct.set(cLogotypeAudio$LAYOUT, cLogotypeAudio$OFFSET, fieldValue);
    }

    private static final AddressLayout rgLogotypeAudio$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("rgLogotypeAudio"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PCERT_LOGOTYPE_AUDIO rgLogotypeAudio
     * }
     */
    public static final AddressLayout rgLogotypeAudio$layout() {
        return rgLogotypeAudio$LAYOUT;
    }

    private static final long rgLogotypeAudio$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PCERT_LOGOTYPE_AUDIO rgLogotypeAudio
     * }
     */
    public static final long rgLogotypeAudio$offset() {
        return rgLogotypeAudio$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PCERT_LOGOTYPE_AUDIO rgLogotypeAudio
     * }
     */
    public static MemorySegment rgLogotypeAudio(MemorySegment struct) {
        return struct.get(rgLogotypeAudio$LAYOUT, rgLogotypeAudio$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PCERT_LOGOTYPE_AUDIO rgLogotypeAudio
     * }
     */
    public static void rgLogotypeAudio(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(rgLogotypeAudio$LAYOUT, rgLogotypeAudio$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

