// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _CMSG_KEY_TRANS_RECIPIENT_INFO {
 *     DWORD dwVersion;
 *     CERT_ID RecipientId;
 *     CRYPT_ALGORITHM_IDENTIFIER KeyEncryptionAlgorithm;
 *     CRYPT_DATA_BLOB EncryptedKey;
 * }
 * }
 */
public class _CMSG_KEY_TRANS_RECIPIENT_INFO {

    _CMSG_KEY_TRANS_RECIPIENT_INFO() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("dwVersion"),
        MemoryLayout.paddingLayout(4),
        _CERT_ID.layout().withName("RecipientId"),
        _CRYPT_ALGORITHM_IDENTIFIER.layout().withName("KeyEncryptionAlgorithm"),
        _CRYPTOAPI_BLOB.layout().withName("EncryptedKey")
    ).withName("_CMSG_KEY_TRANS_RECIPIENT_INFO");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt dwVersion$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwVersion"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwVersion
     * }
     */
    public static final OfInt dwVersion$layout() {
        return dwVersion$LAYOUT;
    }

    private static final long dwVersion$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwVersion
     * }
     */
    public static final long dwVersion$offset() {
        return dwVersion$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwVersion
     * }
     */
    public static int dwVersion(MemorySegment struct) {
        return struct.get(dwVersion$LAYOUT, dwVersion$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwVersion
     * }
     */
    public static void dwVersion(MemorySegment struct, int fieldValue) {
        struct.set(dwVersion$LAYOUT, dwVersion$OFFSET, fieldValue);
    }

    private static final GroupLayout RecipientId$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("RecipientId"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CERT_ID RecipientId
     * }
     */
    public static final GroupLayout RecipientId$layout() {
        return RecipientId$LAYOUT;
    }

    private static final long RecipientId$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CERT_ID RecipientId
     * }
     */
    public static final long RecipientId$offset() {
        return RecipientId$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CERT_ID RecipientId
     * }
     */
    public static MemorySegment RecipientId(MemorySegment struct) {
        return struct.asSlice(RecipientId$OFFSET, RecipientId$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CERT_ID RecipientId
     * }
     */
    public static void RecipientId(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, RecipientId$OFFSET, RecipientId$LAYOUT.byteSize());
    }

    private static final GroupLayout KeyEncryptionAlgorithm$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("KeyEncryptionAlgorithm"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CRYPT_ALGORITHM_IDENTIFIER KeyEncryptionAlgorithm
     * }
     */
    public static final GroupLayout KeyEncryptionAlgorithm$layout() {
        return KeyEncryptionAlgorithm$LAYOUT;
    }

    private static final long KeyEncryptionAlgorithm$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CRYPT_ALGORITHM_IDENTIFIER KeyEncryptionAlgorithm
     * }
     */
    public static final long KeyEncryptionAlgorithm$offset() {
        return KeyEncryptionAlgorithm$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CRYPT_ALGORITHM_IDENTIFIER KeyEncryptionAlgorithm
     * }
     */
    public static MemorySegment KeyEncryptionAlgorithm(MemorySegment struct) {
        return struct.asSlice(KeyEncryptionAlgorithm$OFFSET, KeyEncryptionAlgorithm$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CRYPT_ALGORITHM_IDENTIFIER KeyEncryptionAlgorithm
     * }
     */
    public static void KeyEncryptionAlgorithm(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, KeyEncryptionAlgorithm$OFFSET, KeyEncryptionAlgorithm$LAYOUT.byteSize());
    }

    private static final GroupLayout EncryptedKey$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("EncryptedKey"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CRYPT_DATA_BLOB EncryptedKey
     * }
     */
    public static final GroupLayout EncryptedKey$layout() {
        return EncryptedKey$LAYOUT;
    }

    private static final long EncryptedKey$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CRYPT_DATA_BLOB EncryptedKey
     * }
     */
    public static final long EncryptedKey$offset() {
        return EncryptedKey$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CRYPT_DATA_BLOB EncryptedKey
     * }
     */
    public static MemorySegment EncryptedKey(MemorySegment struct) {
        return struct.asSlice(EncryptedKey$OFFSET, EncryptedKey$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CRYPT_DATA_BLOB EncryptedKey
     * }
     */
    public static void EncryptedKey(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, EncryptedKey$OFFSET, EncryptedKey$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

