// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _CRYPT_VERIFY_CERT_SIGN_WEAK_HASH_INFO {
 *     DWORD cCNGHashAlgid;
 *     PCWSTR *rgpwszCNGHashAlgid;
 *     DWORD dwWeakIndex;
 * }
 * }
 */
public class _CRYPT_VERIFY_CERT_SIGN_WEAK_HASH_INFO {

    _CRYPT_VERIFY_CERT_SIGN_WEAK_HASH_INFO() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("cCNGHashAlgid"),
        MemoryLayout.paddingLayout(4),
        wgl_h.C_POINTER.withName("rgpwszCNGHashAlgid"),
        wgl_h.C_LONG.withName("dwWeakIndex"),
        MemoryLayout.paddingLayout(4)
    ).withName("_CRYPT_VERIFY_CERT_SIGN_WEAK_HASH_INFO");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt cCNGHashAlgid$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cCNGHashAlgid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD cCNGHashAlgid
     * }
     */
    public static final OfInt cCNGHashAlgid$layout() {
        return cCNGHashAlgid$LAYOUT;
    }

    private static final long cCNGHashAlgid$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD cCNGHashAlgid
     * }
     */
    public static final long cCNGHashAlgid$offset() {
        return cCNGHashAlgid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD cCNGHashAlgid
     * }
     */
    public static int cCNGHashAlgid(MemorySegment struct) {
        return struct.get(cCNGHashAlgid$LAYOUT, cCNGHashAlgid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD cCNGHashAlgid
     * }
     */
    public static void cCNGHashAlgid(MemorySegment struct, int fieldValue) {
        struct.set(cCNGHashAlgid$LAYOUT, cCNGHashAlgid$OFFSET, fieldValue);
    }

    private static final AddressLayout rgpwszCNGHashAlgid$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("rgpwszCNGHashAlgid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PCWSTR *rgpwszCNGHashAlgid
     * }
     */
    public static final AddressLayout rgpwszCNGHashAlgid$layout() {
        return rgpwszCNGHashAlgid$LAYOUT;
    }

    private static final long rgpwszCNGHashAlgid$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PCWSTR *rgpwszCNGHashAlgid
     * }
     */
    public static final long rgpwszCNGHashAlgid$offset() {
        return rgpwszCNGHashAlgid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PCWSTR *rgpwszCNGHashAlgid
     * }
     */
    public static MemorySegment rgpwszCNGHashAlgid(MemorySegment struct) {
        return struct.get(rgpwszCNGHashAlgid$LAYOUT, rgpwszCNGHashAlgid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PCWSTR *rgpwszCNGHashAlgid
     * }
     */
    public static void rgpwszCNGHashAlgid(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(rgpwszCNGHashAlgid$LAYOUT, rgpwszCNGHashAlgid$OFFSET, fieldValue);
    }

    private static final OfInt dwWeakIndex$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwWeakIndex"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwWeakIndex
     * }
     */
    public static final OfInt dwWeakIndex$layout() {
        return dwWeakIndex$LAYOUT;
    }

    private static final long dwWeakIndex$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwWeakIndex
     * }
     */
    public static final long dwWeakIndex$offset() {
        return dwWeakIndex$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwWeakIndex
     * }
     */
    public static int dwWeakIndex(MemorySegment struct) {
        return struct.get(dwWeakIndex$LAYOUT, dwWeakIndex$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwWeakIndex
     * }
     */
    public static void dwWeakIndex(MemorySegment struct, int fieldValue) {
        struct.set(dwWeakIndex$LAYOUT, dwWeakIndex$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

