// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _CRYPT_PRIVATE_KEY_INFO {
 *     DWORD Version;
 *     CRYPT_ALGORITHM_IDENTIFIER Algorithm;
 *     CRYPT_DER_BLOB PrivateKey;
 *     PCRYPT_ATTRIBUTES pAttributes;
 * }
 * }
 */
public class _CRYPT_PRIVATE_KEY_INFO {

    _CRYPT_PRIVATE_KEY_INFO() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("Version"),
        MemoryLayout.paddingLayout(4),
        _CRYPT_ALGORITHM_IDENTIFIER.layout().withName("Algorithm"),
        _CRYPTOAPI_BLOB.layout().withName("PrivateKey"),
        wgl_h.C_POINTER.withName("pAttributes")
    ).withName("_CRYPT_PRIVATE_KEY_INFO");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt Version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static final OfInt Version$layout() {
        return Version$LAYOUT;
    }

    private static final long Version$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static final long Version$offset() {
        return Version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static int Version(MemorySegment struct) {
        return struct.get(Version$LAYOUT, Version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static void Version(MemorySegment struct, int fieldValue) {
        struct.set(Version$LAYOUT, Version$OFFSET, fieldValue);
    }

    private static final GroupLayout Algorithm$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("Algorithm"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CRYPT_ALGORITHM_IDENTIFIER Algorithm
     * }
     */
    public static final GroupLayout Algorithm$layout() {
        return Algorithm$LAYOUT;
    }

    private static final long Algorithm$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CRYPT_ALGORITHM_IDENTIFIER Algorithm
     * }
     */
    public static final long Algorithm$offset() {
        return Algorithm$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CRYPT_ALGORITHM_IDENTIFIER Algorithm
     * }
     */
    public static MemorySegment Algorithm(MemorySegment struct) {
        return struct.asSlice(Algorithm$OFFSET, Algorithm$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CRYPT_ALGORITHM_IDENTIFIER Algorithm
     * }
     */
    public static void Algorithm(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, Algorithm$OFFSET, Algorithm$LAYOUT.byteSize());
    }

    private static final GroupLayout PrivateKey$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("PrivateKey"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CRYPT_DER_BLOB PrivateKey
     * }
     */
    public static final GroupLayout PrivateKey$layout() {
        return PrivateKey$LAYOUT;
    }

    private static final long PrivateKey$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CRYPT_DER_BLOB PrivateKey
     * }
     */
    public static final long PrivateKey$offset() {
        return PrivateKey$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CRYPT_DER_BLOB PrivateKey
     * }
     */
    public static MemorySegment PrivateKey(MemorySegment struct) {
        return struct.asSlice(PrivateKey$OFFSET, PrivateKey$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CRYPT_DER_BLOB PrivateKey
     * }
     */
    public static void PrivateKey(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, PrivateKey$OFFSET, PrivateKey$LAYOUT.byteSize());
    }

    private static final AddressLayout pAttributes$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pAttributes"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PCRYPT_ATTRIBUTES pAttributes
     * }
     */
    public static final AddressLayout pAttributes$layout() {
        return pAttributes$LAYOUT;
    }

    private static final long pAttributes$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PCRYPT_ATTRIBUTES pAttributes
     * }
     */
    public static final long pAttributes$offset() {
        return pAttributes$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PCRYPT_ATTRIBUTES pAttributes
     * }
     */
    public static MemorySegment pAttributes(MemorySegment struct) {
        return struct.get(pAttributes$LAYOUT, pAttributes$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PCRYPT_ATTRIBUTES pAttributes
     * }
     */
    public static void pAttributes(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pAttributes$LAYOUT, pAttributes$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

