// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _CSV_QUERY_VOLUME_REDIRECT_STATE {
 *     DWORD MdsNodeId;
 *     DWORD DsNodeId;
 *     BOOLEAN IsDiskConnected;
 *     BOOLEAN ClusterEnableDirectIo;
 *     CSVFS_DISK_CONNECTIVITY DiskConnectivity;
 * }
 * }
 */
public class _CSV_QUERY_VOLUME_REDIRECT_STATE {

    _CSV_QUERY_VOLUME_REDIRECT_STATE() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("MdsNodeId"),
        wgl_h.C_LONG.withName("DsNodeId"),
        wgl_h.C_CHAR.withName("IsDiskConnected"),
        wgl_h.C_CHAR.withName("ClusterEnableDirectIo"),
        MemoryLayout.paddingLayout(2),
        wgl_h.C_INT.withName("DiskConnectivity")
    ).withName("_CSV_QUERY_VOLUME_REDIRECT_STATE");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt MdsNodeId$LAYOUT = (OfInt)$LAYOUT.select(groupElement("MdsNodeId"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD MdsNodeId
     * }
     */
    public static final OfInt MdsNodeId$layout() {
        return MdsNodeId$LAYOUT;
    }

    private static final long MdsNodeId$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD MdsNodeId
     * }
     */
    public static final long MdsNodeId$offset() {
        return MdsNodeId$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD MdsNodeId
     * }
     */
    public static int MdsNodeId(MemorySegment struct) {
        return struct.get(MdsNodeId$LAYOUT, MdsNodeId$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD MdsNodeId
     * }
     */
    public static void MdsNodeId(MemorySegment struct, int fieldValue) {
        struct.set(MdsNodeId$LAYOUT, MdsNodeId$OFFSET, fieldValue);
    }

    private static final OfInt DsNodeId$LAYOUT = (OfInt)$LAYOUT.select(groupElement("DsNodeId"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD DsNodeId
     * }
     */
    public static final OfInt DsNodeId$layout() {
        return DsNodeId$LAYOUT;
    }

    private static final long DsNodeId$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD DsNodeId
     * }
     */
    public static final long DsNodeId$offset() {
        return DsNodeId$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD DsNodeId
     * }
     */
    public static int DsNodeId(MemorySegment struct) {
        return struct.get(DsNodeId$LAYOUT, DsNodeId$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD DsNodeId
     * }
     */
    public static void DsNodeId(MemorySegment struct, int fieldValue) {
        struct.set(DsNodeId$LAYOUT, DsNodeId$OFFSET, fieldValue);
    }

    private static final OfByte IsDiskConnected$LAYOUT = (OfByte)$LAYOUT.select(groupElement("IsDiskConnected"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * BOOLEAN IsDiskConnected
     * }
     */
    public static final OfByte IsDiskConnected$layout() {
        return IsDiskConnected$LAYOUT;
    }

    private static final long IsDiskConnected$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * BOOLEAN IsDiskConnected
     * }
     */
    public static final long IsDiskConnected$offset() {
        return IsDiskConnected$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * BOOLEAN IsDiskConnected
     * }
     */
    public static byte IsDiskConnected(MemorySegment struct) {
        return struct.get(IsDiskConnected$LAYOUT, IsDiskConnected$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * BOOLEAN IsDiskConnected
     * }
     */
    public static void IsDiskConnected(MemorySegment struct, byte fieldValue) {
        struct.set(IsDiskConnected$LAYOUT, IsDiskConnected$OFFSET, fieldValue);
    }

    private static final OfByte ClusterEnableDirectIo$LAYOUT = (OfByte)$LAYOUT.select(groupElement("ClusterEnableDirectIo"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * BOOLEAN ClusterEnableDirectIo
     * }
     */
    public static final OfByte ClusterEnableDirectIo$layout() {
        return ClusterEnableDirectIo$LAYOUT;
    }

    private static final long ClusterEnableDirectIo$OFFSET = 9;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * BOOLEAN ClusterEnableDirectIo
     * }
     */
    public static final long ClusterEnableDirectIo$offset() {
        return ClusterEnableDirectIo$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * BOOLEAN ClusterEnableDirectIo
     * }
     */
    public static byte ClusterEnableDirectIo(MemorySegment struct) {
        return struct.get(ClusterEnableDirectIo$LAYOUT, ClusterEnableDirectIo$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * BOOLEAN ClusterEnableDirectIo
     * }
     */
    public static void ClusterEnableDirectIo(MemorySegment struct, byte fieldValue) {
        struct.set(ClusterEnableDirectIo$LAYOUT, ClusterEnableDirectIo$OFFSET, fieldValue);
    }

    private static final OfInt DiskConnectivity$LAYOUT = (OfInt)$LAYOUT.select(groupElement("DiskConnectivity"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CSVFS_DISK_CONNECTIVITY DiskConnectivity
     * }
     */
    public static final OfInt DiskConnectivity$layout() {
        return DiskConnectivity$LAYOUT;
    }

    private static final long DiskConnectivity$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CSVFS_DISK_CONNECTIVITY DiskConnectivity
     * }
     */
    public static final long DiskConnectivity$offset() {
        return DiskConnectivity$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CSVFS_DISK_CONNECTIVITY DiskConnectivity
     * }
     */
    public static int DiskConnectivity(MemorySegment struct) {
        return struct.get(DiskConnectivity$LAYOUT, DiskConnectivity$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CSVFS_DISK_CONNECTIVITY DiskConnectivity
     * }
     */
    public static void DiskConnectivity(MemorySegment struct, int fieldValue) {
        struct.set(DiskConnectivity$LAYOUT, DiskConnectivity$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

