// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _CTL_FIND_USAGE_PARA {
 *     DWORD cbSize;
 *     CTL_USAGE SubjectUsage;
 *     CRYPT_DATA_BLOB ListIdentifier;
 *     PCERT_INFO pSigner;
 * }
 * }
 */
public class _CTL_FIND_USAGE_PARA {

    _CTL_FIND_USAGE_PARA() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("cbSize"),
        MemoryLayout.paddingLayout(4),
        _CTL_USAGE.layout().withName("SubjectUsage"),
        _CRYPTOAPI_BLOB.layout().withName("ListIdentifier"),
        wgl_h.C_POINTER.withName("pSigner")
    ).withName("_CTL_FIND_USAGE_PARA");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt cbSize$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cbSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD cbSize
     * }
     */
    public static final OfInt cbSize$layout() {
        return cbSize$LAYOUT;
    }

    private static final long cbSize$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD cbSize
     * }
     */
    public static final long cbSize$offset() {
        return cbSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD cbSize
     * }
     */
    public static int cbSize(MemorySegment struct) {
        return struct.get(cbSize$LAYOUT, cbSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD cbSize
     * }
     */
    public static void cbSize(MemorySegment struct, int fieldValue) {
        struct.set(cbSize$LAYOUT, cbSize$OFFSET, fieldValue);
    }

    private static final GroupLayout SubjectUsage$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("SubjectUsage"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CTL_USAGE SubjectUsage
     * }
     */
    public static final GroupLayout SubjectUsage$layout() {
        return SubjectUsage$LAYOUT;
    }

    private static final long SubjectUsage$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CTL_USAGE SubjectUsage
     * }
     */
    public static final long SubjectUsage$offset() {
        return SubjectUsage$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CTL_USAGE SubjectUsage
     * }
     */
    public static MemorySegment SubjectUsage(MemorySegment struct) {
        return struct.asSlice(SubjectUsage$OFFSET, SubjectUsage$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CTL_USAGE SubjectUsage
     * }
     */
    public static void SubjectUsage(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, SubjectUsage$OFFSET, SubjectUsage$LAYOUT.byteSize());
    }

    private static final GroupLayout ListIdentifier$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("ListIdentifier"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CRYPT_DATA_BLOB ListIdentifier
     * }
     */
    public static final GroupLayout ListIdentifier$layout() {
        return ListIdentifier$LAYOUT;
    }

    private static final long ListIdentifier$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CRYPT_DATA_BLOB ListIdentifier
     * }
     */
    public static final long ListIdentifier$offset() {
        return ListIdentifier$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CRYPT_DATA_BLOB ListIdentifier
     * }
     */
    public static MemorySegment ListIdentifier(MemorySegment struct) {
        return struct.asSlice(ListIdentifier$OFFSET, ListIdentifier$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CRYPT_DATA_BLOB ListIdentifier
     * }
     */
    public static void ListIdentifier(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, ListIdentifier$OFFSET, ListIdentifier$LAYOUT.byteSize());
    }

    private static final AddressLayout pSigner$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pSigner"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PCERT_INFO pSigner
     * }
     */
    public static final AddressLayout pSigner$layout() {
        return pSigner$LAYOUT;
    }

    private static final long pSigner$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PCERT_INFO pSigner
     * }
     */
    public static final long pSigner$offset() {
        return pSigner$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PCERT_INFO pSigner
     * }
     */
    public static MemorySegment pSigner(MemorySegment struct) {
        return struct.get(pSigner$LAYOUT, pSigner$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PCERT_INFO pSigner
     * }
     */
    public static void pSigner(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pSigner$LAYOUT, pSigner$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

