// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _DEVICE_DSM_TIERING_QUERY_OUTPUT {
 *     DWORD Version;
 *     DWORD Size;
 *     DWORD Flags;
 *     DWORD Reserved;
 *     DWORDLONG Alignment;
 *     DWORD TotalNumberOfRegions;
 *     DWORD NumberOfRegionsReturned;
 *     STORAGE_TIER_REGION Regions[1];
 * }
 * }
 */
public class _DEVICE_DSM_TIERING_QUERY_OUTPUT {

    _DEVICE_DSM_TIERING_QUERY_OUTPUT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("Version"),
        wgl_h.C_LONG.withName("Size"),
        wgl_h.C_LONG.withName("Flags"),
        wgl_h.C_LONG.withName("Reserved"),
        wgl_h.C_LONG_LONG.withName("Alignment"),
        wgl_h.C_LONG.withName("TotalNumberOfRegions"),
        wgl_h.C_LONG.withName("NumberOfRegionsReturned"),
        MemoryLayout.sequenceLayout(1, _STORAGE_TIER_REGION.layout()).withName("Regions")
    ).withName("_DEVICE_DSM_TIERING_QUERY_OUTPUT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt Version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static final OfInt Version$layout() {
        return Version$LAYOUT;
    }

    private static final long Version$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static final long Version$offset() {
        return Version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static int Version(MemorySegment struct) {
        return struct.get(Version$LAYOUT, Version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static void Version(MemorySegment struct, int fieldValue) {
        struct.set(Version$LAYOUT, Version$OFFSET, fieldValue);
    }

    private static final OfInt Size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static final OfInt Size$layout() {
        return Size$LAYOUT;
    }

    private static final long Size$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static final long Size$offset() {
        return Size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static int Size(MemorySegment struct) {
        return struct.get(Size$LAYOUT, Size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static void Size(MemorySegment struct, int fieldValue) {
        struct.set(Size$LAYOUT, Size$OFFSET, fieldValue);
    }

    private static final OfInt Flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Flags
     * }
     */
    public static final OfInt Flags$layout() {
        return Flags$LAYOUT;
    }

    private static final long Flags$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Flags
     * }
     */
    public static final long Flags$offset() {
        return Flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Flags
     * }
     */
    public static int Flags(MemorySegment struct) {
        return struct.get(Flags$LAYOUT, Flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Flags
     * }
     */
    public static void Flags(MemorySegment struct, int fieldValue) {
        struct.set(Flags$LAYOUT, Flags$OFFSET, fieldValue);
    }

    private static final OfInt Reserved$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Reserved
     * }
     */
    public static final OfInt Reserved$layout() {
        return Reserved$LAYOUT;
    }

    private static final long Reserved$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Reserved
     * }
     */
    public static final long Reserved$offset() {
        return Reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Reserved
     * }
     */
    public static int Reserved(MemorySegment struct) {
        return struct.get(Reserved$LAYOUT, Reserved$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Reserved
     * }
     */
    public static void Reserved(MemorySegment struct, int fieldValue) {
        struct.set(Reserved$LAYOUT, Reserved$OFFSET, fieldValue);
    }

    private static final OfLong Alignment$LAYOUT = (OfLong)$LAYOUT.select(groupElement("Alignment"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORDLONG Alignment
     * }
     */
    public static final OfLong Alignment$layout() {
        return Alignment$LAYOUT;
    }

    private static final long Alignment$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORDLONG Alignment
     * }
     */
    public static final long Alignment$offset() {
        return Alignment$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORDLONG Alignment
     * }
     */
    public static long Alignment(MemorySegment struct) {
        return struct.get(Alignment$LAYOUT, Alignment$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORDLONG Alignment
     * }
     */
    public static void Alignment(MemorySegment struct, long fieldValue) {
        struct.set(Alignment$LAYOUT, Alignment$OFFSET, fieldValue);
    }

    private static final OfInt TotalNumberOfRegions$LAYOUT = (OfInt)$LAYOUT.select(groupElement("TotalNumberOfRegions"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD TotalNumberOfRegions
     * }
     */
    public static final OfInt TotalNumberOfRegions$layout() {
        return TotalNumberOfRegions$LAYOUT;
    }

    private static final long TotalNumberOfRegions$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD TotalNumberOfRegions
     * }
     */
    public static final long TotalNumberOfRegions$offset() {
        return TotalNumberOfRegions$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD TotalNumberOfRegions
     * }
     */
    public static int TotalNumberOfRegions(MemorySegment struct) {
        return struct.get(TotalNumberOfRegions$LAYOUT, TotalNumberOfRegions$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD TotalNumberOfRegions
     * }
     */
    public static void TotalNumberOfRegions(MemorySegment struct, int fieldValue) {
        struct.set(TotalNumberOfRegions$LAYOUT, TotalNumberOfRegions$OFFSET, fieldValue);
    }

    private static final OfInt NumberOfRegionsReturned$LAYOUT = (OfInt)$LAYOUT.select(groupElement("NumberOfRegionsReturned"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD NumberOfRegionsReturned
     * }
     */
    public static final OfInt NumberOfRegionsReturned$layout() {
        return NumberOfRegionsReturned$LAYOUT;
    }

    private static final long NumberOfRegionsReturned$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD NumberOfRegionsReturned
     * }
     */
    public static final long NumberOfRegionsReturned$offset() {
        return NumberOfRegionsReturned$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD NumberOfRegionsReturned
     * }
     */
    public static int NumberOfRegionsReturned(MemorySegment struct) {
        return struct.get(NumberOfRegionsReturned$LAYOUT, NumberOfRegionsReturned$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD NumberOfRegionsReturned
     * }
     */
    public static void NumberOfRegionsReturned(MemorySegment struct, int fieldValue) {
        struct.set(NumberOfRegionsReturned$LAYOUT, NumberOfRegionsReturned$OFFSET, fieldValue);
    }

    private static final SequenceLayout Regions$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("Regions"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * STORAGE_TIER_REGION Regions[1]
     * }
     */
    public static final SequenceLayout Regions$layout() {
        return Regions$LAYOUT;
    }

    private static final long Regions$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * STORAGE_TIER_REGION Regions[1]
     * }
     */
    public static final long Regions$offset() {
        return Regions$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * STORAGE_TIER_REGION Regions[1]
     * }
     */
    public static MemorySegment Regions(MemorySegment struct) {
        return struct.asSlice(Regions$OFFSET, Regions$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * STORAGE_TIER_REGION Regions[1]
     * }
     */
    public static void Regions(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, Regions$OFFSET, Regions$LAYOUT.byteSize());
    }

    private static long[] Regions$DIMS = { 1 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * STORAGE_TIER_REGION Regions[1]
     * }
     */
    public static long[] Regions$dimensions() {
        return Regions$DIMS;
    }
    private static final MethodHandle Regions$ELEM_HANDLE = Regions$LAYOUT.sliceHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * STORAGE_TIER_REGION Regions[1]
     * }
     */
    public static MemorySegment Regions(MemorySegment struct, long index0) {
        try {
            return (MemorySegment)Regions$ELEM_HANDLE.invokeExact(struct, 0L, index0);
        } catch (Throwable ex$) {
            throw new AssertionError("should not reach here", ex$);
        }
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * STORAGE_TIER_REGION Regions[1]
     * }
     */
    public static void Regions(MemorySegment struct, long index0, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, Regions(struct, index0), 0L, _STORAGE_TIER_REGION.layout().byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

