// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _DISK_LOGGING {
 *     BYTE Function;
 *     PVOID BufferAddress;
 *     DWORD BufferSize;
 * }
 * }
 */
public class _DISK_LOGGING {

    _DISK_LOGGING() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_CHAR.withName("Function"),
        MemoryLayout.paddingLayout(7),
        wgl_h.C_POINTER.withName("BufferAddress"),
        wgl_h.C_LONG.withName("BufferSize"),
        MemoryLayout.paddingLayout(4)
    ).withName("_DISK_LOGGING");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfByte Function$LAYOUT = (OfByte)$LAYOUT.select(groupElement("Function"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * BYTE Function
     * }
     */
    public static final OfByte Function$layout() {
        return Function$LAYOUT;
    }

    private static final long Function$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * BYTE Function
     * }
     */
    public static final long Function$offset() {
        return Function$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * BYTE Function
     * }
     */
    public static byte Function(MemorySegment struct) {
        return struct.get(Function$LAYOUT, Function$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * BYTE Function
     * }
     */
    public static void Function(MemorySegment struct, byte fieldValue) {
        struct.set(Function$LAYOUT, Function$OFFSET, fieldValue);
    }

    private static final AddressLayout BufferAddress$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("BufferAddress"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PVOID BufferAddress
     * }
     */
    public static final AddressLayout BufferAddress$layout() {
        return BufferAddress$LAYOUT;
    }

    private static final long BufferAddress$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PVOID BufferAddress
     * }
     */
    public static final long BufferAddress$offset() {
        return BufferAddress$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PVOID BufferAddress
     * }
     */
    public static MemorySegment BufferAddress(MemorySegment struct) {
        return struct.get(BufferAddress$LAYOUT, BufferAddress$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PVOID BufferAddress
     * }
     */
    public static void BufferAddress(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(BufferAddress$LAYOUT, BufferAddress$OFFSET, fieldValue);
    }

    private static final OfInt BufferSize$LAYOUT = (OfInt)$LAYOUT.select(groupElement("BufferSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD BufferSize
     * }
     */
    public static final OfInt BufferSize$layout() {
        return BufferSize$LAYOUT;
    }

    private static final long BufferSize$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD BufferSize
     * }
     */
    public static final long BufferSize$offset() {
        return BufferSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD BufferSize
     * }
     */
    public static int BufferSize(MemorySegment struct) {
        return struct.get(BufferSize$LAYOUT, BufferSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD BufferSize
     * }
     */
    public static void BufferSize(MemorySegment struct, int fieldValue) {
        struct.set(BufferSize$LAYOUT, BufferSize$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

