// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _DRIVER_INFO_4W {
 *     DWORD cVersion;
 *     LPWSTR pName;
 *     LPWSTR pEnvironment;
 *     LPWSTR pDriverPath;
 *     LPWSTR pDataFile;
 *     LPWSTR pConfigFile;
 *     LPWSTR pHelpFile;
 *     LPWSTR pDependentFiles;
 *     LPWSTR pMonitorName;
 *     LPWSTR pDefaultDataType;
 *     LPWSTR pszzPreviousNames;
 * }
 * }
 */
public class _DRIVER_INFO_4W {

    _DRIVER_INFO_4W() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("cVersion"),
        MemoryLayout.paddingLayout(4),
        wgl_h.C_POINTER.withName("pName"),
        wgl_h.C_POINTER.withName("pEnvironment"),
        wgl_h.C_POINTER.withName("pDriverPath"),
        wgl_h.C_POINTER.withName("pDataFile"),
        wgl_h.C_POINTER.withName("pConfigFile"),
        wgl_h.C_POINTER.withName("pHelpFile"),
        wgl_h.C_POINTER.withName("pDependentFiles"),
        wgl_h.C_POINTER.withName("pMonitorName"),
        wgl_h.C_POINTER.withName("pDefaultDataType"),
        wgl_h.C_POINTER.withName("pszzPreviousNames")
    ).withName("_DRIVER_INFO_4W");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt cVersion$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cVersion"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD cVersion
     * }
     */
    public static final OfInt cVersion$layout() {
        return cVersion$LAYOUT;
    }

    private static final long cVersion$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD cVersion
     * }
     */
    public static final long cVersion$offset() {
        return cVersion$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD cVersion
     * }
     */
    public static int cVersion(MemorySegment struct) {
        return struct.get(cVersion$LAYOUT, cVersion$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD cVersion
     * }
     */
    public static void cVersion(MemorySegment struct, int fieldValue) {
        struct.set(cVersion$LAYOUT, cVersion$OFFSET, fieldValue);
    }

    private static final AddressLayout pName$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pName"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * LPWSTR pName
     * }
     */
    public static final AddressLayout pName$layout() {
        return pName$LAYOUT;
    }

    private static final long pName$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * LPWSTR pName
     * }
     */
    public static final long pName$offset() {
        return pName$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * LPWSTR pName
     * }
     */
    public static MemorySegment pName(MemorySegment struct) {
        return struct.get(pName$LAYOUT, pName$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * LPWSTR pName
     * }
     */
    public static void pName(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pName$LAYOUT, pName$OFFSET, fieldValue);
    }

    private static final AddressLayout pEnvironment$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pEnvironment"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * LPWSTR pEnvironment
     * }
     */
    public static final AddressLayout pEnvironment$layout() {
        return pEnvironment$LAYOUT;
    }

    private static final long pEnvironment$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * LPWSTR pEnvironment
     * }
     */
    public static final long pEnvironment$offset() {
        return pEnvironment$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * LPWSTR pEnvironment
     * }
     */
    public static MemorySegment pEnvironment(MemorySegment struct) {
        return struct.get(pEnvironment$LAYOUT, pEnvironment$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * LPWSTR pEnvironment
     * }
     */
    public static void pEnvironment(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pEnvironment$LAYOUT, pEnvironment$OFFSET, fieldValue);
    }

    private static final AddressLayout pDriverPath$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pDriverPath"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * LPWSTR pDriverPath
     * }
     */
    public static final AddressLayout pDriverPath$layout() {
        return pDriverPath$LAYOUT;
    }

    private static final long pDriverPath$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * LPWSTR pDriverPath
     * }
     */
    public static final long pDriverPath$offset() {
        return pDriverPath$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * LPWSTR pDriverPath
     * }
     */
    public static MemorySegment pDriverPath(MemorySegment struct) {
        return struct.get(pDriverPath$LAYOUT, pDriverPath$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * LPWSTR pDriverPath
     * }
     */
    public static void pDriverPath(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pDriverPath$LAYOUT, pDriverPath$OFFSET, fieldValue);
    }

    private static final AddressLayout pDataFile$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pDataFile"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * LPWSTR pDataFile
     * }
     */
    public static final AddressLayout pDataFile$layout() {
        return pDataFile$LAYOUT;
    }

    private static final long pDataFile$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * LPWSTR pDataFile
     * }
     */
    public static final long pDataFile$offset() {
        return pDataFile$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * LPWSTR pDataFile
     * }
     */
    public static MemorySegment pDataFile(MemorySegment struct) {
        return struct.get(pDataFile$LAYOUT, pDataFile$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * LPWSTR pDataFile
     * }
     */
    public static void pDataFile(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pDataFile$LAYOUT, pDataFile$OFFSET, fieldValue);
    }

    private static final AddressLayout pConfigFile$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pConfigFile"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * LPWSTR pConfigFile
     * }
     */
    public static final AddressLayout pConfigFile$layout() {
        return pConfigFile$LAYOUT;
    }

    private static final long pConfigFile$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * LPWSTR pConfigFile
     * }
     */
    public static final long pConfigFile$offset() {
        return pConfigFile$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * LPWSTR pConfigFile
     * }
     */
    public static MemorySegment pConfigFile(MemorySegment struct) {
        return struct.get(pConfigFile$LAYOUT, pConfigFile$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * LPWSTR pConfigFile
     * }
     */
    public static void pConfigFile(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pConfigFile$LAYOUT, pConfigFile$OFFSET, fieldValue);
    }

    private static final AddressLayout pHelpFile$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pHelpFile"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * LPWSTR pHelpFile
     * }
     */
    public static final AddressLayout pHelpFile$layout() {
        return pHelpFile$LAYOUT;
    }

    private static final long pHelpFile$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * LPWSTR pHelpFile
     * }
     */
    public static final long pHelpFile$offset() {
        return pHelpFile$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * LPWSTR pHelpFile
     * }
     */
    public static MemorySegment pHelpFile(MemorySegment struct) {
        return struct.get(pHelpFile$LAYOUT, pHelpFile$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * LPWSTR pHelpFile
     * }
     */
    public static void pHelpFile(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pHelpFile$LAYOUT, pHelpFile$OFFSET, fieldValue);
    }

    private static final AddressLayout pDependentFiles$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pDependentFiles"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * LPWSTR pDependentFiles
     * }
     */
    public static final AddressLayout pDependentFiles$layout() {
        return pDependentFiles$LAYOUT;
    }

    private static final long pDependentFiles$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * LPWSTR pDependentFiles
     * }
     */
    public static final long pDependentFiles$offset() {
        return pDependentFiles$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * LPWSTR pDependentFiles
     * }
     */
    public static MemorySegment pDependentFiles(MemorySegment struct) {
        return struct.get(pDependentFiles$LAYOUT, pDependentFiles$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * LPWSTR pDependentFiles
     * }
     */
    public static void pDependentFiles(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pDependentFiles$LAYOUT, pDependentFiles$OFFSET, fieldValue);
    }

    private static final AddressLayout pMonitorName$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pMonitorName"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * LPWSTR pMonitorName
     * }
     */
    public static final AddressLayout pMonitorName$layout() {
        return pMonitorName$LAYOUT;
    }

    private static final long pMonitorName$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * LPWSTR pMonitorName
     * }
     */
    public static final long pMonitorName$offset() {
        return pMonitorName$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * LPWSTR pMonitorName
     * }
     */
    public static MemorySegment pMonitorName(MemorySegment struct) {
        return struct.get(pMonitorName$LAYOUT, pMonitorName$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * LPWSTR pMonitorName
     * }
     */
    public static void pMonitorName(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pMonitorName$LAYOUT, pMonitorName$OFFSET, fieldValue);
    }

    private static final AddressLayout pDefaultDataType$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pDefaultDataType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * LPWSTR pDefaultDataType
     * }
     */
    public static final AddressLayout pDefaultDataType$layout() {
        return pDefaultDataType$LAYOUT;
    }

    private static final long pDefaultDataType$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * LPWSTR pDefaultDataType
     * }
     */
    public static final long pDefaultDataType$offset() {
        return pDefaultDataType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * LPWSTR pDefaultDataType
     * }
     */
    public static MemorySegment pDefaultDataType(MemorySegment struct) {
        return struct.get(pDefaultDataType$LAYOUT, pDefaultDataType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * LPWSTR pDefaultDataType
     * }
     */
    public static void pDefaultDataType(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pDefaultDataType$LAYOUT, pDefaultDataType$OFFSET, fieldValue);
    }

    private static final AddressLayout pszzPreviousNames$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pszzPreviousNames"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * LPWSTR pszzPreviousNames
     * }
     */
    public static final AddressLayout pszzPreviousNames$layout() {
        return pszzPreviousNames$LAYOUT;
    }

    private static final long pszzPreviousNames$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * LPWSTR pszzPreviousNames
     * }
     */
    public static final long pszzPreviousNames$offset() {
        return pszzPreviousNames$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * LPWSTR pszzPreviousNames
     * }
     */
    public static MemorySegment pszzPreviousNames(MemorySegment struct) {
        return struct.get(pszzPreviousNames$LAYOUT, pszzPreviousNames$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * LPWSTR pszzPreviousNames
     * }
     */
    public static void pszzPreviousNames(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pszzPreviousNames$LAYOUT, pszzPreviousNames$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

