// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _DRIVE_LAYOUT_INFORMATION_GPT {
 *     GUID DiskId;
 *     LARGE_INTEGER StartingUsableOffset;
 *     LARGE_INTEGER UsableLength;
 *     DWORD MaxPartitionCount;
 * }
 * }
 */
public class _DRIVE_LAYOUT_INFORMATION_GPT {

    _DRIVE_LAYOUT_INFORMATION_GPT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        _GUID.layout().withName("DiskId"),
        _LARGE_INTEGER.layout().withName("StartingUsableOffset"),
        _LARGE_INTEGER.layout().withName("UsableLength"),
        wgl_h.C_LONG.withName("MaxPartitionCount"),
        MemoryLayout.paddingLayout(4)
    ).withName("_DRIVE_LAYOUT_INFORMATION_GPT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout DiskId$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("DiskId"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * GUID DiskId
     * }
     */
    public static final GroupLayout DiskId$layout() {
        return DiskId$LAYOUT;
    }

    private static final long DiskId$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * GUID DiskId
     * }
     */
    public static final long DiskId$offset() {
        return DiskId$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * GUID DiskId
     * }
     */
    public static MemorySegment DiskId(MemorySegment struct) {
        return struct.asSlice(DiskId$OFFSET, DiskId$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * GUID DiskId
     * }
     */
    public static void DiskId(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, DiskId$OFFSET, DiskId$LAYOUT.byteSize());
    }

    private static final GroupLayout StartingUsableOffset$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("StartingUsableOffset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * LARGE_INTEGER StartingUsableOffset
     * }
     */
    public static final GroupLayout StartingUsableOffset$layout() {
        return StartingUsableOffset$LAYOUT;
    }

    private static final long StartingUsableOffset$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * LARGE_INTEGER StartingUsableOffset
     * }
     */
    public static final long StartingUsableOffset$offset() {
        return StartingUsableOffset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * LARGE_INTEGER StartingUsableOffset
     * }
     */
    public static MemorySegment StartingUsableOffset(MemorySegment struct) {
        return struct.asSlice(StartingUsableOffset$OFFSET, StartingUsableOffset$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * LARGE_INTEGER StartingUsableOffset
     * }
     */
    public static void StartingUsableOffset(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, StartingUsableOffset$OFFSET, StartingUsableOffset$LAYOUT.byteSize());
    }

    private static final GroupLayout UsableLength$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("UsableLength"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * LARGE_INTEGER UsableLength
     * }
     */
    public static final GroupLayout UsableLength$layout() {
        return UsableLength$LAYOUT;
    }

    private static final long UsableLength$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * LARGE_INTEGER UsableLength
     * }
     */
    public static final long UsableLength$offset() {
        return UsableLength$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * LARGE_INTEGER UsableLength
     * }
     */
    public static MemorySegment UsableLength(MemorySegment struct) {
        return struct.asSlice(UsableLength$OFFSET, UsableLength$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * LARGE_INTEGER UsableLength
     * }
     */
    public static void UsableLength(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, UsableLength$OFFSET, UsableLength$LAYOUT.byteSize());
    }

    private static final OfInt MaxPartitionCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("MaxPartitionCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD MaxPartitionCount
     * }
     */
    public static final OfInt MaxPartitionCount$layout() {
        return MaxPartitionCount$LAYOUT;
    }

    private static final long MaxPartitionCount$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD MaxPartitionCount
     * }
     */
    public static final long MaxPartitionCount$offset() {
        return MaxPartitionCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD MaxPartitionCount
     * }
     */
    public static int MaxPartitionCount(MemorySegment struct) {
        return struct.get(MaxPartitionCount$LAYOUT, MaxPartitionCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD MaxPartitionCount
     * }
     */
    public static void MaxPartitionCount(MemorySegment struct, int fieldValue) {
        struct.set(MaxPartitionCount$LAYOUT, MaxPartitionCount$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

