// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _ENCRYPTION_CERTIFICATE_HASH {
 *     DWORD cbTotalLength;
 *     SID *pUserSid;
 *     PEFS_HASH_BLOB pHash;
 *     LPWSTR lpDisplayInformation;
 * }
 * }
 */
public class _ENCRYPTION_CERTIFICATE_HASH {

    _ENCRYPTION_CERTIFICATE_HASH() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("cbTotalLength"),
        MemoryLayout.paddingLayout(4),
        wgl_h.C_POINTER.withName("pUserSid"),
        wgl_h.C_POINTER.withName("pHash"),
        wgl_h.C_POINTER.withName("lpDisplayInformation")
    ).withName("_ENCRYPTION_CERTIFICATE_HASH");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt cbTotalLength$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cbTotalLength"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD cbTotalLength
     * }
     */
    public static final OfInt cbTotalLength$layout() {
        return cbTotalLength$LAYOUT;
    }

    private static final long cbTotalLength$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD cbTotalLength
     * }
     */
    public static final long cbTotalLength$offset() {
        return cbTotalLength$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD cbTotalLength
     * }
     */
    public static int cbTotalLength(MemorySegment struct) {
        return struct.get(cbTotalLength$LAYOUT, cbTotalLength$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD cbTotalLength
     * }
     */
    public static void cbTotalLength(MemorySegment struct, int fieldValue) {
        struct.set(cbTotalLength$LAYOUT, cbTotalLength$OFFSET, fieldValue);
    }

    private static final AddressLayout pUserSid$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pUserSid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * SID *pUserSid
     * }
     */
    public static final AddressLayout pUserSid$layout() {
        return pUserSid$LAYOUT;
    }

    private static final long pUserSid$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * SID *pUserSid
     * }
     */
    public static final long pUserSid$offset() {
        return pUserSid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * SID *pUserSid
     * }
     */
    public static MemorySegment pUserSid(MemorySegment struct) {
        return struct.get(pUserSid$LAYOUT, pUserSid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * SID *pUserSid
     * }
     */
    public static void pUserSid(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pUserSid$LAYOUT, pUserSid$OFFSET, fieldValue);
    }

    private static final AddressLayout pHash$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pHash"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PEFS_HASH_BLOB pHash
     * }
     */
    public static final AddressLayout pHash$layout() {
        return pHash$LAYOUT;
    }

    private static final long pHash$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PEFS_HASH_BLOB pHash
     * }
     */
    public static final long pHash$offset() {
        return pHash$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PEFS_HASH_BLOB pHash
     * }
     */
    public static MemorySegment pHash(MemorySegment struct) {
        return struct.get(pHash$LAYOUT, pHash$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PEFS_HASH_BLOB pHash
     * }
     */
    public static void pHash(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pHash$LAYOUT, pHash$OFFSET, fieldValue);
    }

    private static final AddressLayout lpDisplayInformation$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("lpDisplayInformation"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * LPWSTR lpDisplayInformation
     * }
     */
    public static final AddressLayout lpDisplayInformation$layout() {
        return lpDisplayInformation$LAYOUT;
    }

    private static final long lpDisplayInformation$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * LPWSTR lpDisplayInformation
     * }
     */
    public static final long lpDisplayInformation$offset() {
        return lpDisplayInformation$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * LPWSTR lpDisplayInformation
     * }
     */
    public static MemorySegment lpDisplayInformation(MemorySegment struct) {
        return struct.get(lpDisplayInformation$LAYOUT, lpDisplayInformation$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * LPWSTR lpDisplayInformation
     * }
     */
    public static void lpDisplayInformation(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(lpDisplayInformation$LAYOUT, lpDisplayInformation$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

