// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _FILE_REGION_OUTPUT {
 *     DWORD Flags;
 *     DWORD TotalRegionEntryCount;
 *     DWORD RegionEntryCount;
 *     DWORD Reserved;
 *     FILE_REGION_INFO Region[1];
 * }
 * }
 */
public class _FILE_REGION_OUTPUT {

    _FILE_REGION_OUTPUT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("Flags"),
        wgl_h.C_LONG.withName("TotalRegionEntryCount"),
        wgl_h.C_LONG.withName("RegionEntryCount"),
        wgl_h.C_LONG.withName("Reserved"),
        MemoryLayout.sequenceLayout(1, _FILE_REGION_INFO.layout()).withName("Region")
    ).withName("_FILE_REGION_OUTPUT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt Flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Flags
     * }
     */
    public static final OfInt Flags$layout() {
        return Flags$LAYOUT;
    }

    private static final long Flags$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Flags
     * }
     */
    public static final long Flags$offset() {
        return Flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Flags
     * }
     */
    public static int Flags(MemorySegment struct) {
        return struct.get(Flags$LAYOUT, Flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Flags
     * }
     */
    public static void Flags(MemorySegment struct, int fieldValue) {
        struct.set(Flags$LAYOUT, Flags$OFFSET, fieldValue);
    }

    private static final OfInt TotalRegionEntryCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("TotalRegionEntryCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD TotalRegionEntryCount
     * }
     */
    public static final OfInt TotalRegionEntryCount$layout() {
        return TotalRegionEntryCount$LAYOUT;
    }

    private static final long TotalRegionEntryCount$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD TotalRegionEntryCount
     * }
     */
    public static final long TotalRegionEntryCount$offset() {
        return TotalRegionEntryCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD TotalRegionEntryCount
     * }
     */
    public static int TotalRegionEntryCount(MemorySegment struct) {
        return struct.get(TotalRegionEntryCount$LAYOUT, TotalRegionEntryCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD TotalRegionEntryCount
     * }
     */
    public static void TotalRegionEntryCount(MemorySegment struct, int fieldValue) {
        struct.set(TotalRegionEntryCount$LAYOUT, TotalRegionEntryCount$OFFSET, fieldValue);
    }

    private static final OfInt RegionEntryCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("RegionEntryCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD RegionEntryCount
     * }
     */
    public static final OfInt RegionEntryCount$layout() {
        return RegionEntryCount$LAYOUT;
    }

    private static final long RegionEntryCount$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD RegionEntryCount
     * }
     */
    public static final long RegionEntryCount$offset() {
        return RegionEntryCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD RegionEntryCount
     * }
     */
    public static int RegionEntryCount(MemorySegment struct) {
        return struct.get(RegionEntryCount$LAYOUT, RegionEntryCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD RegionEntryCount
     * }
     */
    public static void RegionEntryCount(MemorySegment struct, int fieldValue) {
        struct.set(RegionEntryCount$LAYOUT, RegionEntryCount$OFFSET, fieldValue);
    }

    private static final OfInt Reserved$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Reserved
     * }
     */
    public static final OfInt Reserved$layout() {
        return Reserved$LAYOUT;
    }

    private static final long Reserved$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Reserved
     * }
     */
    public static final long Reserved$offset() {
        return Reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Reserved
     * }
     */
    public static int Reserved(MemorySegment struct) {
        return struct.get(Reserved$LAYOUT, Reserved$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Reserved
     * }
     */
    public static void Reserved(MemorySegment struct, int fieldValue) {
        struct.set(Reserved$LAYOUT, Reserved$OFFSET, fieldValue);
    }

    private static final SequenceLayout Region$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("Region"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * FILE_REGION_INFO Region[1]
     * }
     */
    public static final SequenceLayout Region$layout() {
        return Region$LAYOUT;
    }

    private static final long Region$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * FILE_REGION_INFO Region[1]
     * }
     */
    public static final long Region$offset() {
        return Region$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * FILE_REGION_INFO Region[1]
     * }
     */
    public static MemorySegment Region(MemorySegment struct) {
        return struct.asSlice(Region$OFFSET, Region$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * FILE_REGION_INFO Region[1]
     * }
     */
    public static void Region(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, Region$OFFSET, Region$LAYOUT.byteSize());
    }

    private static long[] Region$DIMS = { 1 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * FILE_REGION_INFO Region[1]
     * }
     */
    public static long[] Region$dimensions() {
        return Region$DIMS;
    }
    private static final MethodHandle Region$ELEM_HANDLE = Region$LAYOUT.sliceHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * FILE_REGION_INFO Region[1]
     * }
     */
    public static MemorySegment Region(MemorySegment struct, long index0) {
        try {
            return (MemorySegment)Region$ELEM_HANDLE.invokeExact(struct, 0L, index0);
        } catch (Throwable ex$) {
            throw new AssertionError("should not reach here", ex$);
        }
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * FILE_REGION_INFO Region[1]
     * }
     */
    public static void Region(MemorySegment struct, long index0, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, Region(struct, index0), 0L, _FILE_REGION_INFO.layout().byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

