// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _HTTPSPolicyCallbackData {
 *     union {
 *         DWORD cbStruct;
 *         DWORD cbSize;
 *     };
 *     DWORD dwAuthType;
 *     DWORD fdwChecks;
 *     WCHAR *pwszServerName;
 * }
 * }
 */
public class _HTTPSPolicyCallbackData {

    _HTTPSPolicyCallbackData() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.unionLayout(
            wgl_h.C_LONG.withName("cbStruct"),
            wgl_h.C_LONG.withName("cbSize")
        ).withName("$anon$20164:5"),
        wgl_h.C_LONG.withName("dwAuthType"),
        wgl_h.C_LONG.withName("fdwChecks"),
        MemoryLayout.paddingLayout(4),
        wgl_h.C_POINTER.withName("pwszServerName")
    ).withName("_HTTPSPolicyCallbackData");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt cbStruct$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$20164:5"), groupElement("cbStruct"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD cbStruct
     * }
     */
    public static final OfInt cbStruct$layout() {
        return cbStruct$LAYOUT;
    }

    private static final long cbStruct$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD cbStruct
     * }
     */
    public static final long cbStruct$offset() {
        return cbStruct$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD cbStruct
     * }
     */
    public static int cbStruct(MemorySegment struct) {
        return struct.get(cbStruct$LAYOUT, cbStruct$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD cbStruct
     * }
     */
    public static void cbStruct(MemorySegment struct, int fieldValue) {
        struct.set(cbStruct$LAYOUT, cbStruct$OFFSET, fieldValue);
    }

    private static final OfInt cbSize$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$20164:5"), groupElement("cbSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD cbSize
     * }
     */
    public static final OfInt cbSize$layout() {
        return cbSize$LAYOUT;
    }

    private static final long cbSize$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD cbSize
     * }
     */
    public static final long cbSize$offset() {
        return cbSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD cbSize
     * }
     */
    public static int cbSize(MemorySegment struct) {
        return struct.get(cbSize$LAYOUT, cbSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD cbSize
     * }
     */
    public static void cbSize(MemorySegment struct, int fieldValue) {
        struct.set(cbSize$LAYOUT, cbSize$OFFSET, fieldValue);
    }

    private static final OfInt dwAuthType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwAuthType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwAuthType
     * }
     */
    public static final OfInt dwAuthType$layout() {
        return dwAuthType$LAYOUT;
    }

    private static final long dwAuthType$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwAuthType
     * }
     */
    public static final long dwAuthType$offset() {
        return dwAuthType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwAuthType
     * }
     */
    public static int dwAuthType(MemorySegment struct) {
        return struct.get(dwAuthType$LAYOUT, dwAuthType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwAuthType
     * }
     */
    public static void dwAuthType(MemorySegment struct, int fieldValue) {
        struct.set(dwAuthType$LAYOUT, dwAuthType$OFFSET, fieldValue);
    }

    private static final OfInt fdwChecks$LAYOUT = (OfInt)$LAYOUT.select(groupElement("fdwChecks"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD fdwChecks
     * }
     */
    public static final OfInt fdwChecks$layout() {
        return fdwChecks$LAYOUT;
    }

    private static final long fdwChecks$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD fdwChecks
     * }
     */
    public static final long fdwChecks$offset() {
        return fdwChecks$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD fdwChecks
     * }
     */
    public static int fdwChecks(MemorySegment struct) {
        return struct.get(fdwChecks$LAYOUT, fdwChecks$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD fdwChecks
     * }
     */
    public static void fdwChecks(MemorySegment struct, int fieldValue) {
        struct.set(fdwChecks$LAYOUT, fdwChecks$OFFSET, fieldValue);
    }

    private static final AddressLayout pwszServerName$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pwszServerName"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * WCHAR *pwszServerName
     * }
     */
    public static final AddressLayout pwszServerName$layout() {
        return pwszServerName$LAYOUT;
    }

    private static final long pwszServerName$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * WCHAR *pwszServerName
     * }
     */
    public static final long pwszServerName$offset() {
        return pwszServerName$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * WCHAR *pwszServerName
     * }
     */
    public static MemorySegment pwszServerName(MemorySegment struct) {
        return struct.get(pwszServerName$LAYOUT, pwszServerName$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * WCHAR *pwszServerName
     * }
     */
    public static void pwszServerName(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pwszServerName$LAYOUT, pwszServerName$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

