// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _OCSP_BASIC_RESPONSE_INFO {
 *     DWORD dwVersion;
 *     DWORD dwResponderIdChoice;
 *     union {
 *         CERT_NAME_BLOB ByNameResponderId;
 *         CRYPT_HASH_BLOB ByKeyResponderId;
 *     };
 *     FILETIME ProducedAt;
 *     DWORD cResponseEntry;
 *     POCSP_BASIC_RESPONSE_ENTRY rgResponseEntry;
 *     DWORD cExtension;
 *     PCERT_EXTENSION rgExtension;
 * }
 * }
 */
public class _OCSP_BASIC_RESPONSE_INFO {

    _OCSP_BASIC_RESPONSE_INFO() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("dwVersion"),
        wgl_h.C_LONG.withName("dwResponderIdChoice"),
        MemoryLayout.unionLayout(
            _CRYPTOAPI_BLOB.layout().withName("ByNameResponderId"),
            _CRYPTOAPI_BLOB.layout().withName("ByKeyResponderId")
        ).withName("$anon$5706:5"),
        _FILETIME.layout().withName("ProducedAt"),
        wgl_h.C_LONG.withName("cResponseEntry"),
        MemoryLayout.paddingLayout(4),
        wgl_h.C_POINTER.withName("rgResponseEntry"),
        wgl_h.C_LONG.withName("cExtension"),
        MemoryLayout.paddingLayout(4),
        wgl_h.C_POINTER.withName("rgExtension")
    ).withName("_OCSP_BASIC_RESPONSE_INFO");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt dwVersion$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwVersion"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwVersion
     * }
     */
    public static final OfInt dwVersion$layout() {
        return dwVersion$LAYOUT;
    }

    private static final long dwVersion$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwVersion
     * }
     */
    public static final long dwVersion$offset() {
        return dwVersion$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwVersion
     * }
     */
    public static int dwVersion(MemorySegment struct) {
        return struct.get(dwVersion$LAYOUT, dwVersion$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwVersion
     * }
     */
    public static void dwVersion(MemorySegment struct, int fieldValue) {
        struct.set(dwVersion$LAYOUT, dwVersion$OFFSET, fieldValue);
    }

    private static final OfInt dwResponderIdChoice$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwResponderIdChoice"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwResponderIdChoice
     * }
     */
    public static final OfInt dwResponderIdChoice$layout() {
        return dwResponderIdChoice$LAYOUT;
    }

    private static final long dwResponderIdChoice$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwResponderIdChoice
     * }
     */
    public static final long dwResponderIdChoice$offset() {
        return dwResponderIdChoice$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwResponderIdChoice
     * }
     */
    public static int dwResponderIdChoice(MemorySegment struct) {
        return struct.get(dwResponderIdChoice$LAYOUT, dwResponderIdChoice$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwResponderIdChoice
     * }
     */
    public static void dwResponderIdChoice(MemorySegment struct, int fieldValue) {
        struct.set(dwResponderIdChoice$LAYOUT, dwResponderIdChoice$OFFSET, fieldValue);
    }

    private static final GroupLayout ByNameResponderId$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$5706:5"), groupElement("ByNameResponderId"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CERT_NAME_BLOB ByNameResponderId
     * }
     */
    public static final GroupLayout ByNameResponderId$layout() {
        return ByNameResponderId$LAYOUT;
    }

    private static final long ByNameResponderId$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CERT_NAME_BLOB ByNameResponderId
     * }
     */
    public static final long ByNameResponderId$offset() {
        return ByNameResponderId$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CERT_NAME_BLOB ByNameResponderId
     * }
     */
    public static MemorySegment ByNameResponderId(MemorySegment struct) {
        return struct.asSlice(ByNameResponderId$OFFSET, ByNameResponderId$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CERT_NAME_BLOB ByNameResponderId
     * }
     */
    public static void ByNameResponderId(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, ByNameResponderId$OFFSET, ByNameResponderId$LAYOUT.byteSize());
    }

    private static final GroupLayout ByKeyResponderId$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$5706:5"), groupElement("ByKeyResponderId"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CRYPT_HASH_BLOB ByKeyResponderId
     * }
     */
    public static final GroupLayout ByKeyResponderId$layout() {
        return ByKeyResponderId$LAYOUT;
    }

    private static final long ByKeyResponderId$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CRYPT_HASH_BLOB ByKeyResponderId
     * }
     */
    public static final long ByKeyResponderId$offset() {
        return ByKeyResponderId$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CRYPT_HASH_BLOB ByKeyResponderId
     * }
     */
    public static MemorySegment ByKeyResponderId(MemorySegment struct) {
        return struct.asSlice(ByKeyResponderId$OFFSET, ByKeyResponderId$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CRYPT_HASH_BLOB ByKeyResponderId
     * }
     */
    public static void ByKeyResponderId(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, ByKeyResponderId$OFFSET, ByKeyResponderId$LAYOUT.byteSize());
    }

    private static final GroupLayout ProducedAt$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("ProducedAt"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * FILETIME ProducedAt
     * }
     */
    public static final GroupLayout ProducedAt$layout() {
        return ProducedAt$LAYOUT;
    }

    private static final long ProducedAt$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * FILETIME ProducedAt
     * }
     */
    public static final long ProducedAt$offset() {
        return ProducedAt$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * FILETIME ProducedAt
     * }
     */
    public static MemorySegment ProducedAt(MemorySegment struct) {
        return struct.asSlice(ProducedAt$OFFSET, ProducedAt$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * FILETIME ProducedAt
     * }
     */
    public static void ProducedAt(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, ProducedAt$OFFSET, ProducedAt$LAYOUT.byteSize());
    }

    private static final OfInt cResponseEntry$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cResponseEntry"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD cResponseEntry
     * }
     */
    public static final OfInt cResponseEntry$layout() {
        return cResponseEntry$LAYOUT;
    }

    private static final long cResponseEntry$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD cResponseEntry
     * }
     */
    public static final long cResponseEntry$offset() {
        return cResponseEntry$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD cResponseEntry
     * }
     */
    public static int cResponseEntry(MemorySegment struct) {
        return struct.get(cResponseEntry$LAYOUT, cResponseEntry$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD cResponseEntry
     * }
     */
    public static void cResponseEntry(MemorySegment struct, int fieldValue) {
        struct.set(cResponseEntry$LAYOUT, cResponseEntry$OFFSET, fieldValue);
    }

    private static final AddressLayout rgResponseEntry$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("rgResponseEntry"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * POCSP_BASIC_RESPONSE_ENTRY rgResponseEntry
     * }
     */
    public static final AddressLayout rgResponseEntry$layout() {
        return rgResponseEntry$LAYOUT;
    }

    private static final long rgResponseEntry$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * POCSP_BASIC_RESPONSE_ENTRY rgResponseEntry
     * }
     */
    public static final long rgResponseEntry$offset() {
        return rgResponseEntry$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * POCSP_BASIC_RESPONSE_ENTRY rgResponseEntry
     * }
     */
    public static MemorySegment rgResponseEntry(MemorySegment struct) {
        return struct.get(rgResponseEntry$LAYOUT, rgResponseEntry$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * POCSP_BASIC_RESPONSE_ENTRY rgResponseEntry
     * }
     */
    public static void rgResponseEntry(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(rgResponseEntry$LAYOUT, rgResponseEntry$OFFSET, fieldValue);
    }

    private static final OfInt cExtension$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cExtension"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD cExtension
     * }
     */
    public static final OfInt cExtension$layout() {
        return cExtension$LAYOUT;
    }

    private static final long cExtension$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD cExtension
     * }
     */
    public static final long cExtension$offset() {
        return cExtension$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD cExtension
     * }
     */
    public static int cExtension(MemorySegment struct) {
        return struct.get(cExtension$LAYOUT, cExtension$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD cExtension
     * }
     */
    public static void cExtension(MemorySegment struct, int fieldValue) {
        struct.set(cExtension$LAYOUT, cExtension$OFFSET, fieldValue);
    }

    private static final AddressLayout rgExtension$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("rgExtension"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PCERT_EXTENSION rgExtension
     * }
     */
    public static final AddressLayout rgExtension$layout() {
        return rgExtension$LAYOUT;
    }

    private static final long rgExtension$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PCERT_EXTENSION rgExtension
     * }
     */
    public static final long rgExtension$offset() {
        return rgExtension$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PCERT_EXTENSION rgExtension
     * }
     */
    public static MemorySegment rgExtension(MemorySegment struct) {
        return struct.get(rgExtension$LAYOUT, rgExtension$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PCERT_EXTENSION rgExtension
     * }
     */
    public static void rgExtension(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(rgExtension$LAYOUT, rgExtension$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

