// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _PHYSICAL_ELEMENT_STATUS_REQUEST {
 *     DWORD Version;
 *     DWORD Size;
 *     DWORD StartingElement;
 *     BYTE Filter;
 *     BYTE ReportType;
 *     BYTE Reserved[2];
 * }
 * }
 */
public class _PHYSICAL_ELEMENT_STATUS_REQUEST {

    _PHYSICAL_ELEMENT_STATUS_REQUEST() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("Version"),
        wgl_h.C_LONG.withName("Size"),
        wgl_h.C_LONG.withName("StartingElement"),
        wgl_h.C_CHAR.withName("Filter"),
        wgl_h.C_CHAR.withName("ReportType"),
        MemoryLayout.sequenceLayout(2, wgl_h.C_CHAR).withName("Reserved")
    ).withName("_PHYSICAL_ELEMENT_STATUS_REQUEST");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt Version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static final OfInt Version$layout() {
        return Version$LAYOUT;
    }

    private static final long Version$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static final long Version$offset() {
        return Version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static int Version(MemorySegment struct) {
        return struct.get(Version$LAYOUT, Version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static void Version(MemorySegment struct, int fieldValue) {
        struct.set(Version$LAYOUT, Version$OFFSET, fieldValue);
    }

    private static final OfInt Size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static final OfInt Size$layout() {
        return Size$LAYOUT;
    }

    private static final long Size$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static final long Size$offset() {
        return Size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static int Size(MemorySegment struct) {
        return struct.get(Size$LAYOUT, Size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static void Size(MemorySegment struct, int fieldValue) {
        struct.set(Size$LAYOUT, Size$OFFSET, fieldValue);
    }

    private static final OfInt StartingElement$LAYOUT = (OfInt)$LAYOUT.select(groupElement("StartingElement"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD StartingElement
     * }
     */
    public static final OfInt StartingElement$layout() {
        return StartingElement$LAYOUT;
    }

    private static final long StartingElement$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD StartingElement
     * }
     */
    public static final long StartingElement$offset() {
        return StartingElement$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD StartingElement
     * }
     */
    public static int StartingElement(MemorySegment struct) {
        return struct.get(StartingElement$LAYOUT, StartingElement$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD StartingElement
     * }
     */
    public static void StartingElement(MemorySegment struct, int fieldValue) {
        struct.set(StartingElement$LAYOUT, StartingElement$OFFSET, fieldValue);
    }

    private static final OfByte Filter$LAYOUT = (OfByte)$LAYOUT.select(groupElement("Filter"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * BYTE Filter
     * }
     */
    public static final OfByte Filter$layout() {
        return Filter$LAYOUT;
    }

    private static final long Filter$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * BYTE Filter
     * }
     */
    public static final long Filter$offset() {
        return Filter$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * BYTE Filter
     * }
     */
    public static byte Filter(MemorySegment struct) {
        return struct.get(Filter$LAYOUT, Filter$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * BYTE Filter
     * }
     */
    public static void Filter(MemorySegment struct, byte fieldValue) {
        struct.set(Filter$LAYOUT, Filter$OFFSET, fieldValue);
    }

    private static final OfByte ReportType$LAYOUT = (OfByte)$LAYOUT.select(groupElement("ReportType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * BYTE ReportType
     * }
     */
    public static final OfByte ReportType$layout() {
        return ReportType$LAYOUT;
    }

    private static final long ReportType$OFFSET = 13;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * BYTE ReportType
     * }
     */
    public static final long ReportType$offset() {
        return ReportType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * BYTE ReportType
     * }
     */
    public static byte ReportType(MemorySegment struct) {
        return struct.get(ReportType$LAYOUT, ReportType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * BYTE ReportType
     * }
     */
    public static void ReportType(MemorySegment struct, byte fieldValue) {
        struct.set(ReportType$LAYOUT, ReportType$OFFSET, fieldValue);
    }

    private static final SequenceLayout Reserved$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("Reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * BYTE Reserved[2]
     * }
     */
    public static final SequenceLayout Reserved$layout() {
        return Reserved$LAYOUT;
    }

    private static final long Reserved$OFFSET = 14;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * BYTE Reserved[2]
     * }
     */
    public static final long Reserved$offset() {
        return Reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * BYTE Reserved[2]
     * }
     */
    public static MemorySegment Reserved(MemorySegment struct) {
        return struct.asSlice(Reserved$OFFSET, Reserved$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * BYTE Reserved[2]
     * }
     */
    public static void Reserved(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, Reserved$OFFSET, Reserved$LAYOUT.byteSize());
    }

    private static long[] Reserved$DIMS = { 2 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * BYTE Reserved[2]
     * }
     */
    public static long[] Reserved$dimensions() {
        return Reserved$DIMS;
    }
    private static final VarHandle Reserved$ELEM_HANDLE = Reserved$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * BYTE Reserved[2]
     * }
     */
    public static byte Reserved(MemorySegment struct, long index0) {
        return (byte)Reserved$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * BYTE Reserved[2]
     * }
     */
    public static void Reserved(MemorySegment struct, long index0, byte fieldValue) {
        Reserved$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

