// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _PRINTPROCESSOR_CAPS_2 {
 *     DWORD dwLevel;
 *     DWORD dwNupOptions;
 *     DWORD dwPageOrderFlags;
 *     DWORD dwNumberOfCopies;
 *     DWORD dwDuplexHandlingCaps;
 *     DWORD dwNupDirectionCaps;
 *     DWORD dwNupBorderCaps;
 *     DWORD dwBookletHandlingCaps;
 *     DWORD dwScalingCaps;
 * }
 * }
 */
public class _PRINTPROCESSOR_CAPS_2 {

    _PRINTPROCESSOR_CAPS_2() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("dwLevel"),
        wgl_h.C_LONG.withName("dwNupOptions"),
        wgl_h.C_LONG.withName("dwPageOrderFlags"),
        wgl_h.C_LONG.withName("dwNumberOfCopies"),
        wgl_h.C_LONG.withName("dwDuplexHandlingCaps"),
        wgl_h.C_LONG.withName("dwNupDirectionCaps"),
        wgl_h.C_LONG.withName("dwNupBorderCaps"),
        wgl_h.C_LONG.withName("dwBookletHandlingCaps"),
        wgl_h.C_LONG.withName("dwScalingCaps")
    ).withName("_PRINTPROCESSOR_CAPS_2");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt dwLevel$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwLevel"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwLevel
     * }
     */
    public static final OfInt dwLevel$layout() {
        return dwLevel$LAYOUT;
    }

    private static final long dwLevel$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwLevel
     * }
     */
    public static final long dwLevel$offset() {
        return dwLevel$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwLevel
     * }
     */
    public static int dwLevel(MemorySegment struct) {
        return struct.get(dwLevel$LAYOUT, dwLevel$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwLevel
     * }
     */
    public static void dwLevel(MemorySegment struct, int fieldValue) {
        struct.set(dwLevel$LAYOUT, dwLevel$OFFSET, fieldValue);
    }

    private static final OfInt dwNupOptions$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwNupOptions"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwNupOptions
     * }
     */
    public static final OfInt dwNupOptions$layout() {
        return dwNupOptions$LAYOUT;
    }

    private static final long dwNupOptions$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwNupOptions
     * }
     */
    public static final long dwNupOptions$offset() {
        return dwNupOptions$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwNupOptions
     * }
     */
    public static int dwNupOptions(MemorySegment struct) {
        return struct.get(dwNupOptions$LAYOUT, dwNupOptions$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwNupOptions
     * }
     */
    public static void dwNupOptions(MemorySegment struct, int fieldValue) {
        struct.set(dwNupOptions$LAYOUT, dwNupOptions$OFFSET, fieldValue);
    }

    private static final OfInt dwPageOrderFlags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwPageOrderFlags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwPageOrderFlags
     * }
     */
    public static final OfInt dwPageOrderFlags$layout() {
        return dwPageOrderFlags$LAYOUT;
    }

    private static final long dwPageOrderFlags$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwPageOrderFlags
     * }
     */
    public static final long dwPageOrderFlags$offset() {
        return dwPageOrderFlags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwPageOrderFlags
     * }
     */
    public static int dwPageOrderFlags(MemorySegment struct) {
        return struct.get(dwPageOrderFlags$LAYOUT, dwPageOrderFlags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwPageOrderFlags
     * }
     */
    public static void dwPageOrderFlags(MemorySegment struct, int fieldValue) {
        struct.set(dwPageOrderFlags$LAYOUT, dwPageOrderFlags$OFFSET, fieldValue);
    }

    private static final OfInt dwNumberOfCopies$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwNumberOfCopies"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwNumberOfCopies
     * }
     */
    public static final OfInt dwNumberOfCopies$layout() {
        return dwNumberOfCopies$LAYOUT;
    }

    private static final long dwNumberOfCopies$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwNumberOfCopies
     * }
     */
    public static final long dwNumberOfCopies$offset() {
        return dwNumberOfCopies$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwNumberOfCopies
     * }
     */
    public static int dwNumberOfCopies(MemorySegment struct) {
        return struct.get(dwNumberOfCopies$LAYOUT, dwNumberOfCopies$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwNumberOfCopies
     * }
     */
    public static void dwNumberOfCopies(MemorySegment struct, int fieldValue) {
        struct.set(dwNumberOfCopies$LAYOUT, dwNumberOfCopies$OFFSET, fieldValue);
    }

    private static final OfInt dwDuplexHandlingCaps$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwDuplexHandlingCaps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwDuplexHandlingCaps
     * }
     */
    public static final OfInt dwDuplexHandlingCaps$layout() {
        return dwDuplexHandlingCaps$LAYOUT;
    }

    private static final long dwDuplexHandlingCaps$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwDuplexHandlingCaps
     * }
     */
    public static final long dwDuplexHandlingCaps$offset() {
        return dwDuplexHandlingCaps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwDuplexHandlingCaps
     * }
     */
    public static int dwDuplexHandlingCaps(MemorySegment struct) {
        return struct.get(dwDuplexHandlingCaps$LAYOUT, dwDuplexHandlingCaps$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwDuplexHandlingCaps
     * }
     */
    public static void dwDuplexHandlingCaps(MemorySegment struct, int fieldValue) {
        struct.set(dwDuplexHandlingCaps$LAYOUT, dwDuplexHandlingCaps$OFFSET, fieldValue);
    }

    private static final OfInt dwNupDirectionCaps$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwNupDirectionCaps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwNupDirectionCaps
     * }
     */
    public static final OfInt dwNupDirectionCaps$layout() {
        return dwNupDirectionCaps$LAYOUT;
    }

    private static final long dwNupDirectionCaps$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwNupDirectionCaps
     * }
     */
    public static final long dwNupDirectionCaps$offset() {
        return dwNupDirectionCaps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwNupDirectionCaps
     * }
     */
    public static int dwNupDirectionCaps(MemorySegment struct) {
        return struct.get(dwNupDirectionCaps$LAYOUT, dwNupDirectionCaps$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwNupDirectionCaps
     * }
     */
    public static void dwNupDirectionCaps(MemorySegment struct, int fieldValue) {
        struct.set(dwNupDirectionCaps$LAYOUT, dwNupDirectionCaps$OFFSET, fieldValue);
    }

    private static final OfInt dwNupBorderCaps$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwNupBorderCaps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwNupBorderCaps
     * }
     */
    public static final OfInt dwNupBorderCaps$layout() {
        return dwNupBorderCaps$LAYOUT;
    }

    private static final long dwNupBorderCaps$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwNupBorderCaps
     * }
     */
    public static final long dwNupBorderCaps$offset() {
        return dwNupBorderCaps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwNupBorderCaps
     * }
     */
    public static int dwNupBorderCaps(MemorySegment struct) {
        return struct.get(dwNupBorderCaps$LAYOUT, dwNupBorderCaps$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwNupBorderCaps
     * }
     */
    public static void dwNupBorderCaps(MemorySegment struct, int fieldValue) {
        struct.set(dwNupBorderCaps$LAYOUT, dwNupBorderCaps$OFFSET, fieldValue);
    }

    private static final OfInt dwBookletHandlingCaps$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwBookletHandlingCaps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwBookletHandlingCaps
     * }
     */
    public static final OfInt dwBookletHandlingCaps$layout() {
        return dwBookletHandlingCaps$LAYOUT;
    }

    private static final long dwBookletHandlingCaps$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwBookletHandlingCaps
     * }
     */
    public static final long dwBookletHandlingCaps$offset() {
        return dwBookletHandlingCaps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwBookletHandlingCaps
     * }
     */
    public static int dwBookletHandlingCaps(MemorySegment struct) {
        return struct.get(dwBookletHandlingCaps$LAYOUT, dwBookletHandlingCaps$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwBookletHandlingCaps
     * }
     */
    public static void dwBookletHandlingCaps(MemorySegment struct, int fieldValue) {
        struct.set(dwBookletHandlingCaps$LAYOUT, dwBookletHandlingCaps$OFFSET, fieldValue);
    }

    private static final OfInt dwScalingCaps$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwScalingCaps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwScalingCaps
     * }
     */
    public static final OfInt dwScalingCaps$layout() {
        return dwScalingCaps$LAYOUT;
    }

    private static final long dwScalingCaps$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwScalingCaps
     * }
     */
    public static final long dwScalingCaps$offset() {
        return dwScalingCaps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwScalingCaps
     * }
     */
    public static int dwScalingCaps(MemorySegment struct) {
        return struct.get(dwScalingCaps$LAYOUT, dwScalingCaps$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwScalingCaps
     * }
     */
    public static void dwScalingCaps(MemorySegment struct, int fieldValue) {
        struct.set(dwScalingCaps$LAYOUT, dwScalingCaps$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

