// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _SERVICE_NOTIFY_1 {
 *     DWORD dwVersion;
 *     PFN_SC_NOTIFY_CALLBACK pfnNotifyCallback;
 *     PVOID pContext;
 *     DWORD dwNotificationStatus;
 *     SERVICE_STATUS_PROCESS ServiceStatus;
 * }
 * }
 */
public class _SERVICE_NOTIFY_1 {

    _SERVICE_NOTIFY_1() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("dwVersion"),
        MemoryLayout.paddingLayout(4),
        wgl_h.C_POINTER.withName("pfnNotifyCallback"),
        wgl_h.C_POINTER.withName("pContext"),
        wgl_h.C_LONG.withName("dwNotificationStatus"),
        _SERVICE_STATUS_PROCESS.layout().withName("ServiceStatus")
    ).withName("_SERVICE_NOTIFY_1");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt dwVersion$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwVersion"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwVersion
     * }
     */
    public static final OfInt dwVersion$layout() {
        return dwVersion$LAYOUT;
    }

    private static final long dwVersion$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwVersion
     * }
     */
    public static final long dwVersion$offset() {
        return dwVersion$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwVersion
     * }
     */
    public static int dwVersion(MemorySegment struct) {
        return struct.get(dwVersion$LAYOUT, dwVersion$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwVersion
     * }
     */
    public static void dwVersion(MemorySegment struct, int fieldValue) {
        struct.set(dwVersion$LAYOUT, dwVersion$OFFSET, fieldValue);
    }

    private static final AddressLayout pfnNotifyCallback$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pfnNotifyCallback"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PFN_SC_NOTIFY_CALLBACK pfnNotifyCallback
     * }
     */
    public static final AddressLayout pfnNotifyCallback$layout() {
        return pfnNotifyCallback$LAYOUT;
    }

    private static final long pfnNotifyCallback$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PFN_SC_NOTIFY_CALLBACK pfnNotifyCallback
     * }
     */
    public static final long pfnNotifyCallback$offset() {
        return pfnNotifyCallback$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PFN_SC_NOTIFY_CALLBACK pfnNotifyCallback
     * }
     */
    public static MemorySegment pfnNotifyCallback(MemorySegment struct) {
        return struct.get(pfnNotifyCallback$LAYOUT, pfnNotifyCallback$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PFN_SC_NOTIFY_CALLBACK pfnNotifyCallback
     * }
     */
    public static void pfnNotifyCallback(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pfnNotifyCallback$LAYOUT, pfnNotifyCallback$OFFSET, fieldValue);
    }

    private static final AddressLayout pContext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pContext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PVOID pContext
     * }
     */
    public static final AddressLayout pContext$layout() {
        return pContext$LAYOUT;
    }

    private static final long pContext$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PVOID pContext
     * }
     */
    public static final long pContext$offset() {
        return pContext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PVOID pContext
     * }
     */
    public static MemorySegment pContext(MemorySegment struct) {
        return struct.get(pContext$LAYOUT, pContext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PVOID pContext
     * }
     */
    public static void pContext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pContext$LAYOUT, pContext$OFFSET, fieldValue);
    }

    private static final OfInt dwNotificationStatus$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwNotificationStatus"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwNotificationStatus
     * }
     */
    public static final OfInt dwNotificationStatus$layout() {
        return dwNotificationStatus$LAYOUT;
    }

    private static final long dwNotificationStatus$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwNotificationStatus
     * }
     */
    public static final long dwNotificationStatus$offset() {
        return dwNotificationStatus$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwNotificationStatus
     * }
     */
    public static int dwNotificationStatus(MemorySegment struct) {
        return struct.get(dwNotificationStatus$LAYOUT, dwNotificationStatus$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwNotificationStatus
     * }
     */
    public static void dwNotificationStatus(MemorySegment struct, int fieldValue) {
        struct.set(dwNotificationStatus$LAYOUT, dwNotificationStatus$OFFSET, fieldValue);
    }

    private static final GroupLayout ServiceStatus$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("ServiceStatus"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * SERVICE_STATUS_PROCESS ServiceStatus
     * }
     */
    public static final GroupLayout ServiceStatus$layout() {
        return ServiceStatus$LAYOUT;
    }

    private static final long ServiceStatus$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * SERVICE_STATUS_PROCESS ServiceStatus
     * }
     */
    public static final long ServiceStatus$offset() {
        return ServiceStatus$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * SERVICE_STATUS_PROCESS ServiceStatus
     * }
     */
    public static MemorySegment ServiceStatus(MemorySegment struct) {
        return struct.asSlice(ServiceStatus$OFFSET, ServiceStatus$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * SERVICE_STATUS_PROCESS ServiceStatus
     * }
     */
    public static void ServiceStatus(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, ServiceStatus$OFFSET, ServiceStatus$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

