// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _STORAGE_COUNTERS {
 *     DWORD Version;
 *     DWORD Size;
 *     DWORD NumberOfCounters;
 *     STORAGE_COUNTER Counters[1];
 * }
 * }
 */
public class _STORAGE_COUNTERS {

    _STORAGE_COUNTERS() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("Version"),
        wgl_h.C_LONG.withName("Size"),
        wgl_h.C_LONG.withName("NumberOfCounters"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.sequenceLayout(1, _STORAGE_COUNTER.layout()).withName("Counters")
    ).withName("_STORAGE_COUNTERS");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt Version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static final OfInt Version$layout() {
        return Version$LAYOUT;
    }

    private static final long Version$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static final long Version$offset() {
        return Version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static int Version(MemorySegment struct) {
        return struct.get(Version$LAYOUT, Version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static void Version(MemorySegment struct, int fieldValue) {
        struct.set(Version$LAYOUT, Version$OFFSET, fieldValue);
    }

    private static final OfInt Size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static final OfInt Size$layout() {
        return Size$LAYOUT;
    }

    private static final long Size$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static final long Size$offset() {
        return Size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static int Size(MemorySegment struct) {
        return struct.get(Size$LAYOUT, Size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static void Size(MemorySegment struct, int fieldValue) {
        struct.set(Size$LAYOUT, Size$OFFSET, fieldValue);
    }

    private static final OfInt NumberOfCounters$LAYOUT = (OfInt)$LAYOUT.select(groupElement("NumberOfCounters"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD NumberOfCounters
     * }
     */
    public static final OfInt NumberOfCounters$layout() {
        return NumberOfCounters$LAYOUT;
    }

    private static final long NumberOfCounters$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD NumberOfCounters
     * }
     */
    public static final long NumberOfCounters$offset() {
        return NumberOfCounters$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD NumberOfCounters
     * }
     */
    public static int NumberOfCounters(MemorySegment struct) {
        return struct.get(NumberOfCounters$LAYOUT, NumberOfCounters$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD NumberOfCounters
     * }
     */
    public static void NumberOfCounters(MemorySegment struct, int fieldValue) {
        struct.set(NumberOfCounters$LAYOUT, NumberOfCounters$OFFSET, fieldValue);
    }

    private static final SequenceLayout Counters$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("Counters"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * STORAGE_COUNTER Counters[1]
     * }
     */
    public static final SequenceLayout Counters$layout() {
        return Counters$LAYOUT;
    }

    private static final long Counters$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * STORAGE_COUNTER Counters[1]
     * }
     */
    public static final long Counters$offset() {
        return Counters$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * STORAGE_COUNTER Counters[1]
     * }
     */
    public static MemorySegment Counters(MemorySegment struct) {
        return struct.asSlice(Counters$OFFSET, Counters$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * STORAGE_COUNTER Counters[1]
     * }
     */
    public static void Counters(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, Counters$OFFSET, Counters$LAYOUT.byteSize());
    }

    private static long[] Counters$DIMS = { 1 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * STORAGE_COUNTER Counters[1]
     * }
     */
    public static long[] Counters$dimensions() {
        return Counters$DIMS;
    }
    private static final MethodHandle Counters$ELEM_HANDLE = Counters$LAYOUT.sliceHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * STORAGE_COUNTER Counters[1]
     * }
     */
    public static MemorySegment Counters(MemorySegment struct, long index0) {
        try {
            return (MemorySegment)Counters$ELEM_HANDLE.invokeExact(struct, 0L, index0);
        } catch (Throwable ex$) {
            throw new AssertionError("should not reach here", ex$);
        }
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * STORAGE_COUNTER Counters[1]
     * }
     */
    public static void Counters(MemorySegment struct, long index0, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, Counters(struct, index0), 0L, _STORAGE_COUNTER.layout().byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

