// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _STORAGE_DIAGNOSTIC_DATA {
 *     DWORD Version;
 *     DWORD Size;
 *     GUID ProviderId;
 *     DWORD BufferSize;
 *     DWORD Reserved;
 *     BYTE DiagnosticDataBuffer[1];
 * }
 * }
 */
public class _STORAGE_DIAGNOSTIC_DATA {

    _STORAGE_DIAGNOSTIC_DATA() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("Version"),
        wgl_h.C_LONG.withName("Size"),
        _GUID.layout().withName("ProviderId"),
        wgl_h.C_LONG.withName("BufferSize"),
        wgl_h.C_LONG.withName("Reserved"),
        MemoryLayout.sequenceLayout(1, wgl_h.C_CHAR).withName("DiagnosticDataBuffer"),
        MemoryLayout.paddingLayout(3)
    ).withName("_STORAGE_DIAGNOSTIC_DATA");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt Version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static final OfInt Version$layout() {
        return Version$LAYOUT;
    }

    private static final long Version$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static final long Version$offset() {
        return Version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static int Version(MemorySegment struct) {
        return struct.get(Version$LAYOUT, Version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static void Version(MemorySegment struct, int fieldValue) {
        struct.set(Version$LAYOUT, Version$OFFSET, fieldValue);
    }

    private static final OfInt Size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static final OfInt Size$layout() {
        return Size$LAYOUT;
    }

    private static final long Size$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static final long Size$offset() {
        return Size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static int Size(MemorySegment struct) {
        return struct.get(Size$LAYOUT, Size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static void Size(MemorySegment struct, int fieldValue) {
        struct.set(Size$LAYOUT, Size$OFFSET, fieldValue);
    }

    private static final GroupLayout ProviderId$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("ProviderId"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * GUID ProviderId
     * }
     */
    public static final GroupLayout ProviderId$layout() {
        return ProviderId$LAYOUT;
    }

    private static final long ProviderId$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * GUID ProviderId
     * }
     */
    public static final long ProviderId$offset() {
        return ProviderId$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * GUID ProviderId
     * }
     */
    public static MemorySegment ProviderId(MemorySegment struct) {
        return struct.asSlice(ProviderId$OFFSET, ProviderId$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * GUID ProviderId
     * }
     */
    public static void ProviderId(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, ProviderId$OFFSET, ProviderId$LAYOUT.byteSize());
    }

    private static final OfInt BufferSize$LAYOUT = (OfInt)$LAYOUT.select(groupElement("BufferSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD BufferSize
     * }
     */
    public static final OfInt BufferSize$layout() {
        return BufferSize$LAYOUT;
    }

    private static final long BufferSize$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD BufferSize
     * }
     */
    public static final long BufferSize$offset() {
        return BufferSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD BufferSize
     * }
     */
    public static int BufferSize(MemorySegment struct) {
        return struct.get(BufferSize$LAYOUT, BufferSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD BufferSize
     * }
     */
    public static void BufferSize(MemorySegment struct, int fieldValue) {
        struct.set(BufferSize$LAYOUT, BufferSize$OFFSET, fieldValue);
    }

    private static final OfInt Reserved$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Reserved
     * }
     */
    public static final OfInt Reserved$layout() {
        return Reserved$LAYOUT;
    }

    private static final long Reserved$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Reserved
     * }
     */
    public static final long Reserved$offset() {
        return Reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Reserved
     * }
     */
    public static int Reserved(MemorySegment struct) {
        return struct.get(Reserved$LAYOUT, Reserved$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Reserved
     * }
     */
    public static void Reserved(MemorySegment struct, int fieldValue) {
        struct.set(Reserved$LAYOUT, Reserved$OFFSET, fieldValue);
    }

    private static final SequenceLayout DiagnosticDataBuffer$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("DiagnosticDataBuffer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * BYTE DiagnosticDataBuffer[1]
     * }
     */
    public static final SequenceLayout DiagnosticDataBuffer$layout() {
        return DiagnosticDataBuffer$LAYOUT;
    }

    private static final long DiagnosticDataBuffer$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * BYTE DiagnosticDataBuffer[1]
     * }
     */
    public static final long DiagnosticDataBuffer$offset() {
        return DiagnosticDataBuffer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * BYTE DiagnosticDataBuffer[1]
     * }
     */
    public static MemorySegment DiagnosticDataBuffer(MemorySegment struct) {
        return struct.asSlice(DiagnosticDataBuffer$OFFSET, DiagnosticDataBuffer$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * BYTE DiagnosticDataBuffer[1]
     * }
     */
    public static void DiagnosticDataBuffer(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, DiagnosticDataBuffer$OFFSET, DiagnosticDataBuffer$LAYOUT.byteSize());
    }

    private static long[] DiagnosticDataBuffer$DIMS = { 1 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * BYTE DiagnosticDataBuffer[1]
     * }
     */
    public static long[] DiagnosticDataBuffer$dimensions() {
        return DiagnosticDataBuffer$DIMS;
    }
    private static final VarHandle DiagnosticDataBuffer$ELEM_HANDLE = DiagnosticDataBuffer$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * BYTE DiagnosticDataBuffer[1]
     * }
     */
    public static byte DiagnosticDataBuffer(MemorySegment struct, long index0) {
        return (byte)DiagnosticDataBuffer$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * BYTE DiagnosticDataBuffer[1]
     * }
     */
    public static void DiagnosticDataBuffer(MemorySegment struct, long index0, byte fieldValue) {
        DiagnosticDataBuffer$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

