// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _TXFS_ROLLFORWARD_REDO_INFORMATION {
 *     LARGE_INTEGER LastVirtualClock;
 *     DWORDLONG LastRedoLsn;
 *     DWORDLONG HighestRecoveryLsn;
 *     DWORD Flags;
 * }
 * }
 */
public class _TXFS_ROLLFORWARD_REDO_INFORMATION {

    _TXFS_ROLLFORWARD_REDO_INFORMATION() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        _LARGE_INTEGER.layout().withName("LastVirtualClock"),
        wgl_h.C_LONG_LONG.withName("LastRedoLsn"),
        wgl_h.C_LONG_LONG.withName("HighestRecoveryLsn"),
        wgl_h.C_LONG.withName("Flags"),
        MemoryLayout.paddingLayout(4)
    ).withName("_TXFS_ROLLFORWARD_REDO_INFORMATION");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout LastVirtualClock$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("LastVirtualClock"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * LARGE_INTEGER LastVirtualClock
     * }
     */
    public static final GroupLayout LastVirtualClock$layout() {
        return LastVirtualClock$LAYOUT;
    }

    private static final long LastVirtualClock$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * LARGE_INTEGER LastVirtualClock
     * }
     */
    public static final long LastVirtualClock$offset() {
        return LastVirtualClock$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * LARGE_INTEGER LastVirtualClock
     * }
     */
    public static MemorySegment LastVirtualClock(MemorySegment struct) {
        return struct.asSlice(LastVirtualClock$OFFSET, LastVirtualClock$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * LARGE_INTEGER LastVirtualClock
     * }
     */
    public static void LastVirtualClock(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, LastVirtualClock$OFFSET, LastVirtualClock$LAYOUT.byteSize());
    }

    private static final OfLong LastRedoLsn$LAYOUT = (OfLong)$LAYOUT.select(groupElement("LastRedoLsn"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORDLONG LastRedoLsn
     * }
     */
    public static final OfLong LastRedoLsn$layout() {
        return LastRedoLsn$LAYOUT;
    }

    private static final long LastRedoLsn$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORDLONG LastRedoLsn
     * }
     */
    public static final long LastRedoLsn$offset() {
        return LastRedoLsn$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORDLONG LastRedoLsn
     * }
     */
    public static long LastRedoLsn(MemorySegment struct) {
        return struct.get(LastRedoLsn$LAYOUT, LastRedoLsn$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORDLONG LastRedoLsn
     * }
     */
    public static void LastRedoLsn(MemorySegment struct, long fieldValue) {
        struct.set(LastRedoLsn$LAYOUT, LastRedoLsn$OFFSET, fieldValue);
    }

    private static final OfLong HighestRecoveryLsn$LAYOUT = (OfLong)$LAYOUT.select(groupElement("HighestRecoveryLsn"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORDLONG HighestRecoveryLsn
     * }
     */
    public static final OfLong HighestRecoveryLsn$layout() {
        return HighestRecoveryLsn$LAYOUT;
    }

    private static final long HighestRecoveryLsn$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORDLONG HighestRecoveryLsn
     * }
     */
    public static final long HighestRecoveryLsn$offset() {
        return HighestRecoveryLsn$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORDLONG HighestRecoveryLsn
     * }
     */
    public static long HighestRecoveryLsn(MemorySegment struct) {
        return struct.get(HighestRecoveryLsn$LAYOUT, HighestRecoveryLsn$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORDLONG HighestRecoveryLsn
     * }
     */
    public static void HighestRecoveryLsn(MemorySegment struct, long fieldValue) {
        struct.set(HighestRecoveryLsn$LAYOUT, HighestRecoveryLsn$OFFSET, fieldValue);
    }

    private static final OfInt Flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Flags
     * }
     */
    public static final OfInt Flags$layout() {
        return Flags$LAYOUT;
    }

    private static final long Flags$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Flags
     * }
     */
    public static final long Flags$offset() {
        return Flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Flags
     * }
     */
    public static int Flags(MemorySegment struct) {
        return struct.get(Flags$LAYOUT, Flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Flags
     * }
     */
    public static void Flags(MemorySegment struct, int fieldValue) {
        struct.set(Flags$LAYOUT, Flags$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

