// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _WIN32_STREAM_ID {
 *     DWORD dwStreamId;
 *     DWORD dwStreamAttributes;
 *     LARGE_INTEGER Size;
 *     DWORD dwStreamNameSize;
 *     WCHAR cStreamName[1];
 * }
 * }
 */
public class _WIN32_STREAM_ID {

    _WIN32_STREAM_ID() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("dwStreamId"),
        wgl_h.C_LONG.withName("dwStreamAttributes"),
        _LARGE_INTEGER.layout().withName("Size"),
        wgl_h.C_LONG.withName("dwStreamNameSize"),
        MemoryLayout.sequenceLayout(1, wgl_h.C_SHORT).withName("cStreamName"),
        MemoryLayout.paddingLayout(2)
    ).withName("_WIN32_STREAM_ID");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt dwStreamId$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwStreamId"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwStreamId
     * }
     */
    public static final OfInt dwStreamId$layout() {
        return dwStreamId$LAYOUT;
    }

    private static final long dwStreamId$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwStreamId
     * }
     */
    public static final long dwStreamId$offset() {
        return dwStreamId$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwStreamId
     * }
     */
    public static int dwStreamId(MemorySegment struct) {
        return struct.get(dwStreamId$LAYOUT, dwStreamId$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwStreamId
     * }
     */
    public static void dwStreamId(MemorySegment struct, int fieldValue) {
        struct.set(dwStreamId$LAYOUT, dwStreamId$OFFSET, fieldValue);
    }

    private static final OfInt dwStreamAttributes$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwStreamAttributes"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwStreamAttributes
     * }
     */
    public static final OfInt dwStreamAttributes$layout() {
        return dwStreamAttributes$LAYOUT;
    }

    private static final long dwStreamAttributes$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwStreamAttributes
     * }
     */
    public static final long dwStreamAttributes$offset() {
        return dwStreamAttributes$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwStreamAttributes
     * }
     */
    public static int dwStreamAttributes(MemorySegment struct) {
        return struct.get(dwStreamAttributes$LAYOUT, dwStreamAttributes$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwStreamAttributes
     * }
     */
    public static void dwStreamAttributes(MemorySegment struct, int fieldValue) {
        struct.set(dwStreamAttributes$LAYOUT, dwStreamAttributes$OFFSET, fieldValue);
    }

    private static final GroupLayout Size$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("Size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * LARGE_INTEGER Size
     * }
     */
    public static final GroupLayout Size$layout() {
        return Size$LAYOUT;
    }

    private static final long Size$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * LARGE_INTEGER Size
     * }
     */
    public static final long Size$offset() {
        return Size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * LARGE_INTEGER Size
     * }
     */
    public static MemorySegment Size(MemorySegment struct) {
        return struct.asSlice(Size$OFFSET, Size$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * LARGE_INTEGER Size
     * }
     */
    public static void Size(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, Size$OFFSET, Size$LAYOUT.byteSize());
    }

    private static final OfInt dwStreamNameSize$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwStreamNameSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwStreamNameSize
     * }
     */
    public static final OfInt dwStreamNameSize$layout() {
        return dwStreamNameSize$LAYOUT;
    }

    private static final long dwStreamNameSize$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwStreamNameSize
     * }
     */
    public static final long dwStreamNameSize$offset() {
        return dwStreamNameSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwStreamNameSize
     * }
     */
    public static int dwStreamNameSize(MemorySegment struct) {
        return struct.get(dwStreamNameSize$LAYOUT, dwStreamNameSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwStreamNameSize
     * }
     */
    public static void dwStreamNameSize(MemorySegment struct, int fieldValue) {
        struct.set(dwStreamNameSize$LAYOUT, dwStreamNameSize$OFFSET, fieldValue);
    }

    private static final SequenceLayout cStreamName$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("cStreamName"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * WCHAR cStreamName[1]
     * }
     */
    public static final SequenceLayout cStreamName$layout() {
        return cStreamName$LAYOUT;
    }

    private static final long cStreamName$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * WCHAR cStreamName[1]
     * }
     */
    public static final long cStreamName$offset() {
        return cStreamName$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * WCHAR cStreamName[1]
     * }
     */
    public static MemorySegment cStreamName(MemorySegment struct) {
        return struct.asSlice(cStreamName$OFFSET, cStreamName$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * WCHAR cStreamName[1]
     * }
     */
    public static void cStreamName(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, cStreamName$OFFSET, cStreamName$LAYOUT.byteSize());
    }

    private static long[] cStreamName$DIMS = { 1 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * WCHAR cStreamName[1]
     * }
     */
    public static long[] cStreamName$dimensions() {
        return cStreamName$DIMS;
    }
    private static final VarHandle cStreamName$ELEM_HANDLE = cStreamName$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * WCHAR cStreamName[1]
     * }
     */
    public static short cStreamName(MemorySegment struct, long index0) {
        return (short)cStreamName$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * WCHAR cStreamName[1]
     * }
     */
    public static void cStreamName(MemorySegment struct, long index0, short fieldValue) {
        cStreamName$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

