// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
public class DDEUP {

    static final  GroupLayout $struct$LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            MemoryLayout.paddingLayout(12).withName("unused"),
            MemoryLayout.paddingLayout(1).withName("fAck"),
            MemoryLayout.paddingLayout(1).withName("fRelease"),
            MemoryLayout.paddingLayout(1).withName("fReserved"),
            MemoryLayout.paddingLayout(1).withName("fAckReq")
        ),
        Constants$root.C_SHORT$LAYOUT.withName("cfFormat"),
        MemoryLayout.sequenceLayout(1, Constants$root.C_CHAR$LAYOUT).withName("rgb"),
        MemoryLayout.paddingLayout(8)
    );
    public static MemoryLayout $LAYOUT() {
        return DDEUP.$struct$LAYOUT;
    }
    static final VarHandle cfFormat$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("cfFormat"));
    public static VarHandle cfFormat$VH() {
        return DDEUP.cfFormat$VH;
    }
    public static short cfFormat$get(MemorySegment seg) {
        return (short)DDEUP.cfFormat$VH.get(seg);
    }
    public static void cfFormat$set( MemorySegment seg, short x) {
        DDEUP.cfFormat$VH.set(seg, x);
    }
    public static short cfFormat$get(MemorySegment seg, long index) {
        return (short)DDEUP.cfFormat$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void cfFormat$set(MemorySegment seg, long index, short x) {
        DDEUP.cfFormat$VH.set(seg.asSlice(index*sizeof()), x);
    }
    public static MemorySegment rgb$slice(MemorySegment seg) {
        return seg.asSlice(4, 1);
    }
    public static long sizeof() { return $LAYOUT().byteSize(); }
    public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
    public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
    }
    public static MemorySegment ofAddress(MemoryAddress addr, MemorySession session) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, session); }
}


