// Generated by jextract

package wgl.windows.x86;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct tagIMECHARPOSITION {
 *     DWORD dwSize;
 *     DWORD dwCharPos;
 *     POINT pt;
 *     UINT cLineHeight;
 *     RECT rcDocument;
 * }
 * }
 */
public class tagIMECHARPOSITION {

    tagIMECHARPOSITION() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wgl_h.C_LONG.withName("dwSize"),
        wgl_h.C_LONG.withName("dwCharPos"),
        tagPOINT.layout().withName("pt"),
        wgl_h.C_INT.withName("cLineHeight"),
        tagRECT.layout().withName("rcDocument")
    ).withName("tagIMECHARPOSITION");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt dwSize$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwSize
     * }
     */
    public static final OfInt dwSize$layout() {
        return dwSize$LAYOUT;
    }

    private static final long dwSize$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwSize
     * }
     */
    public static final long dwSize$offset() {
        return dwSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwSize
     * }
     */
    public static int dwSize(MemorySegment struct) {
        return struct.get(dwSize$LAYOUT, dwSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwSize
     * }
     */
    public static void dwSize(MemorySegment struct, int fieldValue) {
        struct.set(dwSize$LAYOUT, dwSize$OFFSET, fieldValue);
    }

    private static final OfInt dwCharPos$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dwCharPos"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD dwCharPos
     * }
     */
    public static final OfInt dwCharPos$layout() {
        return dwCharPos$LAYOUT;
    }

    private static final long dwCharPos$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD dwCharPos
     * }
     */
    public static final long dwCharPos$offset() {
        return dwCharPos$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD dwCharPos
     * }
     */
    public static int dwCharPos(MemorySegment struct) {
        return struct.get(dwCharPos$LAYOUT, dwCharPos$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD dwCharPos
     * }
     */
    public static void dwCharPos(MemorySegment struct, int fieldValue) {
        struct.set(dwCharPos$LAYOUT, dwCharPos$OFFSET, fieldValue);
    }

    private static final GroupLayout pt$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("pt"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * POINT pt
     * }
     */
    public static final GroupLayout pt$layout() {
        return pt$LAYOUT;
    }

    private static final long pt$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * POINT pt
     * }
     */
    public static final long pt$offset() {
        return pt$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * POINT pt
     * }
     */
    public static MemorySegment pt(MemorySegment struct) {
        return struct.asSlice(pt$OFFSET, pt$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * POINT pt
     * }
     */
    public static void pt(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, pt$OFFSET, pt$LAYOUT.byteSize());
    }

    private static final OfInt cLineHeight$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cLineHeight"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * UINT cLineHeight
     * }
     */
    public static final OfInt cLineHeight$layout() {
        return cLineHeight$LAYOUT;
    }

    private static final long cLineHeight$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * UINT cLineHeight
     * }
     */
    public static final long cLineHeight$offset() {
        return cLineHeight$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * UINT cLineHeight
     * }
     */
    public static int cLineHeight(MemorySegment struct) {
        return struct.get(cLineHeight$LAYOUT, cLineHeight$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * UINT cLineHeight
     * }
     */
    public static void cLineHeight(MemorySegment struct, int fieldValue) {
        struct.set(cLineHeight$LAYOUT, cLineHeight$OFFSET, fieldValue);
    }

    private static final GroupLayout rcDocument$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("rcDocument"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * RECT rcDocument
     * }
     */
    public static final GroupLayout rcDocument$layout() {
        return rcDocument$LAYOUT;
    }

    private static final long rcDocument$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * RECT rcDocument
     * }
     */
    public static final long rcDocument$offset() {
        return rcDocument$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * RECT rcDocument
     * }
     */
    public static MemorySegment rcDocument(MemorySegment struct) {
        return struct.asSlice(rcDocument$OFFSET, rcDocument$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * RECT rcDocument
     * }
     */
    public static void rcDocument(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, rcDocument$OFFSET, rcDocument$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

