// Generated by jextract

package wglext.windows.x86;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
public class _MIDL_STUB_MESSAGE {

    static final  GroupLayout $struct$LAYOUT = MemoryLayout.structLayout(
        Constants$root.C_POINTER$LAYOUT.withName("RpcMsg"),
        Constants$root.C_POINTER$LAYOUT.withName("Buffer"),
        Constants$root.C_POINTER$LAYOUT.withName("BufferStart"),
        Constants$root.C_POINTER$LAYOUT.withName("BufferEnd"),
        Constants$root.C_POINTER$LAYOUT.withName("BufferMark"),
        Constants$root.C_LONG$LAYOUT.withName("BufferLength"),
        Constants$root.C_LONG$LAYOUT.withName("MemorySize"),
        Constants$root.C_POINTER$LAYOUT.withName("Memory"),
        Constants$root.C_CHAR$LAYOUT.withName("IsClient"),
        Constants$root.C_CHAR$LAYOUT.withName("Pad"),
        Constants$root.C_SHORT$LAYOUT.withName("uFlags2"),
        Constants$root.C_LONG$LAYOUT.withName("ReuseBuffer"),
        Constants$root.C_POINTER$LAYOUT.withName("pAllocAllNodesContext"),
        Constants$root.C_POINTER$LAYOUT.withName("pPointerQueueState"),
        Constants$root.C_LONG$LAYOUT.withName("IgnoreEmbeddedPointers"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("PointerBufferMark"),
        Constants$root.C_CHAR$LAYOUT.withName("CorrDespIncrement"),
        Constants$root.C_CHAR$LAYOUT.withName("uFlags"),
        Constants$root.C_SHORT$LAYOUT.withName("UniquePtrCount"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_LONG_LONG$LAYOUT.withName("MaxCount"),
        Constants$root.C_LONG$LAYOUT.withName("Offset"),
        Constants$root.C_LONG$LAYOUT.withName("ActualCount"),
        Constants$root.C_POINTER$LAYOUT.withName("pfnAllocate"),
        Constants$root.C_POINTER$LAYOUT.withName("pfnFree"),
        Constants$root.C_POINTER$LAYOUT.withName("StackTop"),
        Constants$root.C_POINTER$LAYOUT.withName("pPresentedType"),
        Constants$root.C_POINTER$LAYOUT.withName("pTransmitType"),
        Constants$root.C_POINTER$LAYOUT.withName("SavedHandle"),
        Constants$root.C_POINTER$LAYOUT.withName("StubDesc"),
        Constants$root.C_POINTER$LAYOUT.withName("FullPtrXlatTables"),
        Constants$root.C_LONG$LAYOUT.withName("FullPtrRefId"),
        Constants$root.C_LONG$LAYOUT.withName("PointerLength"),
        MemoryLayout.structLayout(
            MemoryLayout.paddingLayout(1).withName("fInDontFree"),
            MemoryLayout.paddingLayout(1).withName("fDontCallFreeInst"),
            MemoryLayout.paddingLayout(1).withName("fUnused1"),
            MemoryLayout.paddingLayout(1).withName("fHasReturn"),
            MemoryLayout.paddingLayout(1).withName("fHasExtensions"),
            MemoryLayout.paddingLayout(1).withName("fHasNewCorrDesc"),
            MemoryLayout.paddingLayout(1).withName("fIsIn"),
            MemoryLayout.paddingLayout(1).withName("fIsOut"),
            MemoryLayout.paddingLayout(1).withName("fIsOicf"),
            MemoryLayout.paddingLayout(1).withName("fBufferValid"),
            MemoryLayout.paddingLayout(1).withName("fHasMemoryValidateCallback"),
            MemoryLayout.paddingLayout(1).withName("fInFree"),
            MemoryLayout.paddingLayout(1).withName("fNeedMCCP"),
            MemoryLayout.paddingLayout(3).withName("fUnused2"),
            MemoryLayout.paddingLayout(16).withName("fUnused3")
        ),
        Constants$root.C_LONG$LAYOUT.withName("dwDestContext"),
        Constants$root.C_POINTER$LAYOUT.withName("pvDestContext"),
        Constants$root.C_POINTER$LAYOUT.withName("SavedContextHandles"),
        Constants$root.C_LONG$LAYOUT.withName("ParamNumber"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("pRpcChannelBuffer"),
        Constants$root.C_POINTER$LAYOUT.withName("pArrayInfo"),
        Constants$root.C_POINTER$LAYOUT.withName("SizePtrCountArray"),
        Constants$root.C_POINTER$LAYOUT.withName("SizePtrOffsetArray"),
        Constants$root.C_POINTER$LAYOUT.withName("SizePtrLengthArray"),
        Constants$root.C_POINTER$LAYOUT.withName("pArgQueue"),
        Constants$root.C_LONG$LAYOUT.withName("dwStubPhase"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("LowStackMark"),
        Constants$root.C_POINTER$LAYOUT.withName("pAsyncMsg"),
        Constants$root.C_POINTER$LAYOUT.withName("pCorrInfo"),
        Constants$root.C_POINTER$LAYOUT.withName("pCorrMemory"),
        Constants$root.C_POINTER$LAYOUT.withName("pMemoryList"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("pCSInfo"),
        Constants$root.C_POINTER$LAYOUT.withName("ConformanceMark"),
        Constants$root.C_POINTER$LAYOUT.withName("VarianceMark"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("Unused"),
        Constants$root.C_POINTER$LAYOUT.withName("pContext"),
        Constants$root.C_POINTER$LAYOUT.withName("ContextHandleHash"),
        Constants$root.C_POINTER$LAYOUT.withName("pUserMarshalList"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("Reserved51_3"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("Reserved51_4"),
