// Generated by jextract

package wglext.windows.x86;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
public class tagPROPVARIANT {

    static final  GroupLayout $struct$LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.unionLayout(
            MemoryLayout.structLayout(
                Constants$root.C_SHORT$LAYOUT.withName("vt"),
                Constants$root.C_SHORT$LAYOUT.withName("wReserved1"),
                Constants$root.C_SHORT$LAYOUT.withName("wReserved2"),
                Constants$root.C_SHORT$LAYOUT.withName("wReserved3"),
                MemoryLayout.unionLayout(
                    Constants$root.C_CHAR$LAYOUT.withName("cVal"),
                    Constants$root.C_CHAR$LAYOUT.withName("bVal"),
                    Constants$root.C_SHORT$LAYOUT.withName("iVal"),
                    Constants$root.C_SHORT$LAYOUT.withName("uiVal"),
                    Constants$root.C_LONG$LAYOUT.withName("lVal"),
                    Constants$root.C_LONG$LAYOUT.withName("ulVal"),
                    Constants$root.C_LONG$LAYOUT.withName("intVal"),
                    Constants$root.C_LONG$LAYOUT.withName("uintVal"),
                    MemoryLayout.unionLayout(
                        MemoryLayout.structLayout(
                            Constants$root.C_LONG$LAYOUT.withName("LowPart"),
                            Constants$root.C_LONG$LAYOUT.withName("HighPart")
                        ).withName("$anon$0"),
                        MemoryLayout.structLayout(
                            Constants$root.C_LONG$LAYOUT.withName("LowPart"),
                            Constants$root.C_LONG$LAYOUT.withName("HighPart")
                        ).withName("u"),
                        Constants$root.C_LONG_LONG$LAYOUT.withName("QuadPart")
                    ).withName("hVal"),
                    MemoryLayout.unionLayout(
                        MemoryLayout.structLayout(
                            Constants$root.C_LONG$LAYOUT.withName("LowPart"),
                            Constants$root.C_LONG$LAYOUT.withName("HighPart")
                        ).withName("$anon$0"),
                        MemoryLayout.structLayout(
                            Constants$root.C_LONG$LAYOUT.withName("LowPart"),
                            Constants$root.C_LONG$LAYOUT.withName("HighPart")
                        ).withName("u"),
                        Constants$root.C_LONG_LONG$LAYOUT.withName("QuadPart")
                    ).withName("uhVal"),
                    Constants$root.C_FLOAT$LAYOUT.withName("fltVal"),
                    Constants$root.C_DOUBLE$LAYOUT.withName("dblVal"),
                    Constants$root.C_SHORT$LAYOUT.withName("boolVal"),
                    Constants$root.C_SHORT$LAYOUT.withName("__OBSOLETE__VARIANT_BOOL"),
                    Constants$root.C_LONG$LAYOUT.withName("scode"),
                    MemoryLayout.unionLayout(
                        MemoryLayout.structLayout(
                            Constants$root.C_LONG$LAYOUT.withName("Lo"),
                            Constants$root.C_LONG$LAYOUT.withName("Hi")
                        ).withName("$anon$0"),
                        Constants$root.C_LONG_LONG$LAYOUT.withName("int64")
                    ).withName("cyVal"),
                    Constants$root.C_DOUBLE$LAYOUT.withName("date"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("dwLowDateTime"),
                        Constants$root.C_LONG$LAYOUT.withName("dwHighDateTime")
                    ).withName("filetime"),
                    Constants$root.C_POINTER$LAYOUT.withName("puuid"),
                    Constants$root.C_POINTER$LAYOUT.withName("pclipdata"),
                    Constants$root.C_POINTER$LAYOUT.withName("bstrVal"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cbSize"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pData")
                    ).withName("bstrblobVal"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cbSize"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pBlobData")
                    ).withName("blob"),
                    Constants$root.C_POINTER$LAYOUT.withName("pszVal"),
                    Constants$root.C_POINTER$LAYOUT.withName("pwszVal"),
                    Constants$root.C_POINTER$LAYOUT.withName("punkVal"),
                    Constants$root.C_POINTER$LAYOUT.withName("pdispVal"),
                    Constants$root.C_POINTER$LAYOUT.withName("pStream"),
                    Constants$root.C_POINTER$LAYOUT.withName("pStorage"),
                    Constants$root.C_POINTER$LAYOUT.withName("pVersionedStream"),
                    Constants$root.C_POINTER$LAYOUT.withName("parray"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("cac"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("caub"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("cai"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("caui"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("cal"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("caul"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("cah"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("cauh"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("caflt"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("cadbl"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("cabool"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("cascode"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("cacy"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("cadate"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("cafiletime"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("cauuid"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("caclipdata"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("cabstr"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("cabstrblob"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("calpstr"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("calpwstr"),
                    MemoryLayout.structLayout(
                        Constants$root.C_LONG$LAYOUT.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        Constants$root.C_POINTER$LAYOUT.withName("pElems")
                    ).withName("capropvar"),
                    Constants$root.C_POINTER$LAYOUT.withName("pcVal"),
                    Constants$root.C_POINTER$LAYOUT.withName("pbVal"),
                    Constants$root.C_POINTER$LAYOUT.withName("piVal"),
                    Constants$root.C_POINTER$LAYOUT.withName("puiVal"),
                    Constants$root.C_POINTER$LAYOUT.withName("plVal"),
                    Constants$root.C_POINTER$LAYOUT.withName("pulVal"),
                    Constants$root.C_POINTER$LAYOUT.withName("pintVal"),
                    Constants$root.C_POINTER$LAYOUT.withName("puintVal"),
                    Constants$root.C_POINTER$LAYOUT.withName("pfltVal"),
                    Constants$root.C_POINTER$LAYOUT.withName("pdblVal"),
                    Constants$root.C_POINTER$LAYOUT.withName("pboolVal"),
